[
  {
    "name": "Class IV Glee Club",
    "dept": "Music",
    "notes": "Class IV ",
    "desc": "Students electing Class IV Glee Club will perform a wide variety of pieces, including Western and non-Western choral pieces from various historical periods. There will be two major performances a year. No prior experience is needed. "
  },
  {
    "name": "Orchestra",
    "dept": "Music",
    "notes": "Class IV ",
    "desc": "Students electing Orchestra will also perform two concerts each year, playing orchestral music from a wide range of historical periods. Students electing Orchestra typically will have their own instruments and experience in playing them. "
  },
  {
    "name": "Jazz Combo",
    "dept": "Music",
    "notes": "Class IV ",
    "desc": "Class IV Jazz Combo offers an introductory experience in improvisation skills and small-ensemble playing. Students electing Jazz Combo typically will have their own instruments and experience in playing them "
  },
  {
    "name": "General Music",
    "dept": "Music",
    "notes": "Class IV ",
    "desc": "General Music surveys musical cultures and includes a performance and music technology element. No prior experience is needed. "
  },
  {
    "name": "Fundamentals of Guitar",
    "dept": "Music",
    "notes": "Class IV ",
    "desc": "In Fundamentals of Guitar, students will learn the fundamentals of guitar playing, with no prior experience of instrumental music learning required. Students will learn basic notation, chord symbols, songwriting, and ensemble playing, culminating in end of-semester performances for the school community. Emphasis will be placed on learning basic skills through classic and modern pop songs. Guitar ownership is encouraged, however, a guitar will be provided, if needed. "
  },
  {
    "name": "Music Theory",
    "dept": "Music",
    "notes": "(Half Course) ",
    "desc": "Starting with the fundamentals of music, this course explores a wide variety of music theory topics and theoretical problems. Music is examined through harmonic and melodic analysis. Besides the written analysis, music is examined from an aural standpoint through ear training and sight singing. No past musical experience is necessary, although it is helpful. "
  },
  {
    "name": "Chamber Singers",
    "dept": "Music",
    "notes": "(Half Course) ",
    "desc": "This is a performing organization that emphasizes tone and detail of phrasing. Students study and perform great choral literature from every period, especially literature that is written for smaller choral groups. Individuals improve their sight reading skills, their vocal technique, and their knowledge of musical styles. Membership in Glee Club and an audition are required. "
  },
  {
    "name": "Chamber Orchestra",
    "dept": "Music",
    "notes": "(Half Course) ",
    "desc": "The chamber orchestra consists of woodwind, brass, string, or percussion players. Students will experience and perform repertoire of other ensemble types (e.g., wind band, string orchestra, chamber music), gaining core competencies to become collaborative, creative ensemble oriented musicians. A virtual audition will be required during the summer to section students prior to the opening of the fall semester. "
  },
  {
    "name": "Advanced Chamber Music Seminar",
    "dept": "Music",
    "notes": "(Half Course) ",
    "desc": "The advanced chamber music seminar provides a rigorous, intensive environment in which students can investigate the nature of chamber music and the musician's role in a small ensemble. Students will develop skills in ensemble playing and rehearsal techniques through the preparation and performance of developmentally appropriate chamber repertoire. Participation in the program is dependent on the availability of a place within a viable ensemble and a virtual audition over the summer. Those enrolled in this course will be required to regularly rehearse with the chamber orchestra as part of the course. Violinists may also be required to learn viola in order to create flexibility of instrumentation. (Permission of the department chair is required.) "
  },
  {
    "name": "Music Package",
    "dept": "Music",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement In place of a single Arts Program course, students with special interest in music may satisfy the arts requirement through a combination of musical activities. The Music Package, designed by and for each student, includes one of the half courses offered by the department, comprising performance experience through choral singing, chamber music, orchestral playing, or jazz. Students are required to participate in a course-based performing ensemble each year they are at Milton. Additionally, students must complete a class in music theory or music history, either at Milton or by a faculty-approved equivalent course outside of school. Music lessons may be part of the package, but lessons alone do not fulfill the performance component. In lieu of music history or theory, students can propose an independent project, using their musical abilities to create social and civic impact in their community. A written application for the Music Package should specify the components of the package and requires the approval of both the music department chair and the academic dean. Applications must be completed by March of the Class II year. "
  },
  {
    "name": "Jazz Improvisation",
    "dept": "Music",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course gives students experience in ensemble playing and improvisation in the jazz and jazz/rock idioms. Students learn and play in a group, and explore the tunes for structure and harmony. This course emphasizes listening to recordings integral to the course work. Elementary knowledge of scales is required. The focus is on the development of improvisational and ensemble skills through playing. (Permission of the department chair is required.) "
  },
  {
    "name": "Dance",
    "dept": "Performing Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This comprehensive course is designed both for students who have had little or no previous formal dance experience and for the intermediate-level dancer. Students explore and practice the principles of dance technique, improvisation, and composition, working to develop greater awareness, freedom, and control in the use of the body as an instrument of expression. Ballet, modern, and other dance styles will be introduced and practiced. "
  },
  {
    "name": "Advanced Dance: Modern",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course is designed for students prepared to work at the advanced or intermediate level in modern dance technique. Students practice advanced warm-up exercises, center combinations, and movement patterns. Students may learn repertory from established modern dance choreographers. In addition to technique, students explore improvisation and dance composition in a more in-depth manner, culminating in a collaborative performance in the Winter Dance Concert. (Prerequisite: Arts Program Dance or permission of the department chair.) "
  },
  {
    "name": "Advanced Dance: Ballet",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course is designed for dancers prepared to work at the advanced or intermediate level in ballet technique. Students practice advanced warm-up exercises, center combinations, and movement patterns. In addition to technique, students may learn repertory from choreographed ballets. (Prerequisite: Arts Program Dance or permission of the department chair.) "
  },
  {
    "name": "Advanced Dance: Choreography",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course explores the path from improvisational dancing to sophisticated dance making. In a fun and supportive atmosphere, students cultivate their natural movement resources, developing movement ideas into fully shaped dance and movement pieces. Students also study relevant and well established choreographers. No formal dance training is required; however, the ability and the desire to move are necessary. Students in this course will work collaboratively to create and perform a dance for the Winter Dance Concert. This course is strongly recommended for students interested in choreographing as individuals for the Winter Dance Concert. (Permission of the department chair is required.) "
  },
  {
    "name": "Drama",
    "dept": "Performing Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course teaches acting skills to students of all experience levels. From interested novices to the advanced performer, each actor is given tools to continue their performing arts growth. Exercises and scene work aim at developing concentration, freedom, and power of expression, connection with a text and with acting partners, and a process for approaching characterization. The emphasis is on representational acting techniques and contemporary, realistic texts. Attendance at all Upper School performances is required. Excursions to professional productions may be required. "
  },
  {
    "name": "Advanced Drama: Directing",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course introduces students to the principles and practices of directing for the stage. The course is project-based, and emphasizes hands-on instruction and exploration in the directing of scenes and short plays. Students learn the basics of concept development, actor coaching, and blocking. The course is highlighted with a public presentation of student directed work in the spring. Students will also shadow faculty directors and may act as assistant directors for current-season productions. (Prerequisite: Arts Program Drama or equivalent experience and permission from the department chair.) "
  },
  {
    "name": "Advanced Drama: Improvisation",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course covers the many aspects of improvisation, such as quick and thorough thinking on one’s feet; creating believable characters; the use of subtext, concentration, imagination, and observation in short and long-form non-scripted scenes; working cooperatively with an ensemble and audience; creating truthful relationships; and the use of the body and voice as communicative instruments. Through participating in class activities, attending two off-campus shows, and performing in public, students will become more spontaneous, trusting, and cooperative performers. (Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Drama: Musical Theatre",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course focuses on developing skills in acting, singing, and dancing for musical theatre. The course is team-taught by members of the Performing Arts and Music Departments and combines exercises and scene work from contemporary Broadway musical theatre. The course culminates in a public performance by members of the class. (Prerequisite: Arts Program Drama or equivalent experience and permission of the department chair.) "
  },
  {
    "name": "Page to Stage",
    "dept": "Performing Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement How do you bring stories to life? This performance-based course gives students the tools to create captivating presentations from a variety of sources, such as prose, children’s literature, newspaper articles, plays, poetry, and even cereal boxes. With text in hand, students will develop the physical, vocal, and interpretive skills necessary to engage audiences through the use of their personal voice. Course performances may include presentations with the Lower School, Arts Night, and other cross-campus collaborative opportunities. "
  },
  {
    "name": "Spoken Word Poetry",
    "dept": "Performing Arts",
    "notes": "(Half Course) ",
    "desc": "Learn to become a bold and creative writer/ performer! In this course students will immerse themselves in the world of spoken word poetry by reading, listening to, and watching the work of accomplished poets. Modeled after the collegiate writing process, coursework will include workshops centering students’ original poetry while honing their poetic craft and critical feedback skills. These pieces will be brought to life through a variety of performance approaches to create meaningful group and individual live performances. Students will explore styles of spoken word, slam, and dramatic poetry readings. "
  },
  {
    "name": "Design for the Theatre",
    "dept": "Performing Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course introduces students to the collaborative art of scenic design, lighting design, and costume design. In the first semester, students will explore the elements and principles of design through hands-on projects in perspective drawing, technical drafting, watercolor rendering, and scale model construction. Two-dimensional work will be explored using Vectorworks and other digital design tools along with free hand drawing and drafting techniques. In the second semester, students will form a design team for a spring production. Through play analysis, hands-on projects, and collaboration, each student will create a complete design for an actualized project. These projects may include a full design or specific projects within a design. The course culminates in a presentation of a design portfolio composed of drafting, renderings, and models illustrating growth throughout the year. "
  },
  {
    "name": "Advanced Drama: Costume Design",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course explores costume design and construction through theoretical and practical projects. Students will learn basic sketching, hand- and machine-sewing techniques, pattern reading and adaptation, millinery techniques, and costume jewelry making. In addition, through play-reading and analysis as well as historical research, students will develop and present costume plots, individual character costume sketches, and design concepts. "
  },
  {
    "name": "Advanced Drama: Hidden Voices in Theatre",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "In this advanced level acting course, students will explore contemporary plays highlighting largely underrepresented voices both in terms of subject matter and playwright. Students will perform scenes and monologues from these plays, interact with working playwrights, and write about their discoveries throughout the course. (Prerequisite: Arts Program Drama or Page To Stage or equivalent experience and permission from the department chair.) "
  },
  {
    "name": "Hamlet",
    "dept": "Performing Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course is team-taught by a member of the English Department and a member of the Performing Arts Department. Please see the full course description in the English section. "
  },
  {
    "name": "Drawing|Painting + Design",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement In this intensive, year-long foundations course, students will be introduced to the foundations of drawing and painting in the fall semester. In the spring semester, they will apply those techniques with design thinking in printmaking, digital imaging and composition, and new media. This course, for students who like making and creating, allows beginners to succeed and experienced students to be challenged. All assignments are hands-on and studio based, with basic exercises culminating in major projects. Students will learn visual language, apply techniques, and solve problems by means of a creative process, all supplemented by a broad introduction to art history, aesthetics and criticism, and the most contemporary modes of art-making. Each student will be urged to explore ideas, experiment with an open mind, and make expressions personal, dramatic, and original. The course will include field trips to art museums and contact with professional artists. "
  },
  {
    "name": "Photography|Digital Imaging + Design",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course introduces students to the art of seeing and picture-making from its analog origins to today’s digital contemporary practices. In the first semester, students will learn the concepts of exposure with a digital camera before shifting to a 35mm film camera where the techniques of film development and wet darkroom printing will be taught. Students will develop their eye and composition skills through hands-on projects that also provide exposure to the great canon of photographic masters; deepen their own expressive ability; and gain an understanding of how photography was developed from the late 19th century through the first half of the 20th century. In the second semester, students will shift into the digital realm, working with DSLRs and becoming fluent with industry standard programs such as Adobe Bridge, Photoshop, and CameraRaw, all through application tutorials and project based learning. All projects will introduce contemporary photographers and address the growth of this medium, with the advent of color and digital technology. Students will feel confident in their understanding of the medium both technically and artistically, and with their ability to access the visual language to express their ideas. "
  },
  {
    "name": "Sculpture|Ceramics + 3-D Design",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course introduces students to the foundations of three-dimensional design and the construction of functional and artistic objects. Students solve a series of design problems with hands-on projects, acquire skills in the use of hand and power tools, and learn design principles that inform both industrial and fine arts. Projects will be designed to explore a variety of techniques in diverse sculptural media, such as wood, metal, clay, plaster, and plastics. Students will address design challenges through creative processes while learning about underlying concepts of art through discussions of art history, aesthetics, and criticism. Digital processes, including 3-D printing will also be explored. Students will be encouraged to investigate ideas, experiment with an open mind, and produce original and personal expressions. "
  },
  {
    "name": "Technology|Media + Design",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course introduces the basic principles and practices of design using contemporary, new and rising technologies. The course is project-based, emphasizing hands on instruction, experimentation, and exploration in new media, including digital imaging and graphic design, animation, industrial design with 3-D modeling and printing, and environmental/installation art. Particular emphasis will be placed on imaginative innovation and critical thinking, and the exploration of both existing and new interpretations of design in contemporary art. Students will be expected to reach beyond current definitions and boundaries of traditional art forms and applications in a collaborative spirit of discovery. "
  },
  {
    "name": "Filmmaking + Design",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "Satisfies Arts Program Requirement This course introduces students to the basic principles and practices of digital movie-making, visual storytelling, and cinematography. The course is project-based, emphasizing hands-on instruction and exploration in the creation of short films. Students learn the basics of pre-production, effective camera technique, the editing process, and production management. "
  },
  {
    "name": "Advanced Drawing",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "In this course, students will explore major genres of drawings from classical styles to contemporary as well as architectural, narrative, figurative, and abstract. Through individual and collaborative projects, sketchbooks, readings, and discussions, students will be guided in developing a visual language and personal style. Students will use a range of familiar drawing materials such as graphite, charcoal, and pastel and will be introduced to new materials and techniques. The class will take drawing excursions around campus and to other nearby areas, including Boston museums. The culmination of the course is a large-scale DIY project blending realistic observational drawing with drawing from imagination, fantasy, and abstraction. (Prerequisite: Drawing|Painting + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Photography: Digital Imaging",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "This course builds upon foundational skills to explore photography in the digital age. In a hands-on, project-based curriculum, students work exclusively with DSLRs and push their understanding of the medium and their own personal creativity. Projects will introduce some of today’s most revolutionary photographers, and will ask students to reimagine how photography can be manipulated as a mode for personal and artistic expression. Students will increase their fluency in programs such as Adobe Bridge, Photoshop, and CameraRaw, learning advanced editing techniques through supplemental tutorials and projects. Throughout the semester, students will explore studio lighting, still-life photography, advanced compositing and retouching, and printing with large format printers. A portfolio of finished and mounted prints will be expected, including large format display prints. Support for the creation of portfolios for college admission will be integral to early work. (Prerequisite: Photography|Digital Imaging + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Sculpture",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "Advanced Sculpture builds upon foundational skills to explore a range of ideas and possibilities through a variety of three-dimensional projects. Students will be introduced to more advanced sculptural techniques involving additive and subtractive processes in materials such as wood, metal, plaster, and stone. Students will be able to communicate concepts and intentions through the manipulation of subject matter, organizational components, media, and processes. Projects will include both figurative and abstract creations and will explore design applications through contemporary modes of production. Working together in a classroom structure, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: Sculpture|Ceramics + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Technology: Graphic Design",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "Building upon the technology foundations course that surveys many design genres, this class delves into a semester-long study of graphic design. Otherwise known as communication design, this art form focuses on how to effectively express ideas through visual art and textual content. Students will study art and images, typography, and layout for both the physical and virtual world (print versus digital content). Projects will emphasize originality and hands-on experimentation of advanced applications in technology. Two dimensional work will be primarily composed in Adobe Illustrator, InDesign, and Photoshop but may also include animation with Flash and 3-D modeling and printing. (Prerequisite: Technology|Media + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Filmmaking",
    "dept": "Visual Arts",
    "notes": "(Half Course) Classes I & II ",
    "desc": "Building on the foundation of knowledge, skills, and techniques learned in the Filmmaking + Design course, this year long, half credit course seeks to strengthen students’ mastery of story writing, production management, directing, camera use, and editing. Students will study and create short films and documentaries; individual interests can be explored throughout the process, allowing students to hone their filmmaking skills and expand their repertoire. Student work will be entered into appropriate film festival competitions and screened to the community in the spring. (Prerequisite: Filmmaking + Design or permission of the department chair.) "
  },
  {
    "name": "History of Western Art",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "(Not offered in 2023–24) This course traces the trajectory of European and Western Art from roots in ancient cultures to the 19th century and it includes examples of contemporary art for comparison. Art can reveal to its audience the morals and priorities of a culture or simply allow us a glimpse into their fantasies. Onlookers may feel understood, inspired, or excluded. We will contextualize works of art and artists in social and political context to better understand the tensions or harmonies therein, incorporating in-depth coverage of select artworks, periods, and artistic movements. The focus of our study is to critically engage with works of art with considerations of material, historical context, artist, and audience. Students will hone skills of visual analysis through close observation of artworks. In support, readings in art theory and art historical analysis from primary sources will be shared and students will be asked to synthesize ideas in essay writing. Insight into processes of various disciplines of artmaking will be gained through short hands-on studio assignments as well as local field trips to Boston-area museums and galleries; and the course will also include an introduction to curatorial and editorial practice in Milton’s Nesto Gallery. Recommended in conjunction with Contemporary and Global Art Studies. "
  },
  {
    "name": "Advanced Painting",
    "dept": "Visual Arts",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "In this course, students will explore painting techniques across a variety of media, primarily using water-soluble oils, but also acrylic and watercolor. Students will be challenged to “think in color” and to “see the light” in relation to form and space; they will paint both from life and from their imaginations. Subjects may range from abstract works, still life, the human face and figure, and the landscape to stories and fantasies of surrealistic and invented worlds. Each student will work to develop their own personal vision through an experience of different styles and techniques. Field trips may be part of this course and are intended to expose students to the contemporary art scene. (Prerequisite: Drawing|Painting + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Photography: Alternative Processes",
    "dept": "Visual Arts",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "This course builds upon foundational techniques in digital and analog photography, working both in the digital/ technical design realm and returning to the darkroom to explore alternative processes in photography. In a hands-on, project-based curriculum, students experiment with new kinds of cameras, such as medium format Holgas, camera obscuras, pinhole cameras, and others. Darkroom skills will be refined, and different printing techniques, such as multiple exposures, solarizations, photo transfers, and cyanotypes, will be explored. Digital processes and alternative image manipulation in Photoshop will also be an integral part of this exploratory course. Students will study photographic masters from the past and present who have challenged the traditional uses of the medium, pushing both the technical and expressive boundaries of creativity. A portfolio of finished and mounted prints will be expected, including large format display prints. Support for the creation of portfolios for college admission will be integral to early work. (Prerequisite: Photography|Digital Imaging + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Ceramics",
    "dept": "Visual Arts",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "This course builds upon the foundational techniques of working with clay: sculptural hand-building, slab and coil construction, wheel throwing, mold-making, and glazing. Individual expression in clay, whether artistic or functional, will be emphasized. Students will be able to communicate concepts and intentions through the manipulation of subject matter, organizational components, and surface treatments. Projects will include traditional functional objects such as teapots and bowls, repetitive casting, and large abstract sculptural expressions. Students will gain a deeper understanding of both the historical and contemporary significance of ceramics through class discussions, critiques, and field trips. (Prerequisite: Sculpture|Ceramics + Design or permission of the department chair.) "
  },
  {
    "name": "Advanced Technology: Industrial Design",
    "dept": "Visual Arts",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "This course introduces industrial design and the practice of creating products, devices, objects, and services that are used every day in the real world. Students build off their visual foundation and delve into a human-centered design process from the initial development to the refined stages that consider appearance, functionality, and manufacturability. Coursework will be project-centered with an emphasis on experimentation, expression, and collaboration. Students will practice analog drawing, digital renderings, and 3-D modeling to create original well-executed design pieces. A hybrid of advanced applications, including the Adobe application suite, Rhino, and Makerbot software will be utilized. (Prerequisite: Technology|Media + Design or permission of the department chair.) "
  },
  {
    "name": "Contemporary & Global Art Studies",
    "dept": "Visual Arts",
    "notes": "",
    "desc": "(Not offered in 2023–24) This class will provide an introduction to global and contemporary art in terms of cultural, social, and political values from ancient civilizations to the present. The focus is on exposure to works of art from different times and diverse cultures. Art can reveal to its audience the morals and priorities of a culture or simply allow us a glimpse into their fantasies. Art may be state-sponsored propaganda or personal dissent, and has the power to change the course of history. Viewers may feel understood, inspired, or excluded. We will seek to better understand the inclusion and exclusion of artists in the traditional canon of Western Art. Students will read recent scholarship and scientific analysis that call into question the foundations of the traditional art historical timeline and hierarchy. They will contextualize works of art and artists in social and political context to better understand the tensions or harmonies. Students will critically engage in looking at and reading works of art with considerations of material, historical context, artist, and audience. Students will discuss select works from different periods and cultures using comparative analysis and appropriate terminology. Through close observation of artworks, they will hone skills of visual analysis. Readings in art theory and art historical context from primary sources will be assigned and students will synthesize ideas and observations in essay writing. Students will gain insight into processes of various disciplines of artmaking through short hands-on studio assignments, a field trip to New York City museums and galleries (if possible), and practice of curatorial and editorial skills in Milton’s Nesto Gallery. Recommended in conjunction with History of Western Art. "
  },
  {
    "name": "Architecture",
    "dept": "Visual Arts",
    "notes": "(Half Course) ",
    "desc": "This course offers a project-based introduction to the concepts and processes of architectural design through the lens of the local community around us. Students will explore both two-dimensional and three-dimensional design through drawing formats of sketching, orthographic plan views, conceptual renderings of form, building structural studies, model-making, Google Sketch-Up, and photography. Architectural styles and conceptual studies of form will also be reviewed and integrated within each project. (Permission of the department chair is required.) "
  },
  {
    "name": "Printmaking",
    "dept": "Visual Arts",
    "notes": "(Half Course) ",
    "desc": "In this course, students will explore the basics of four major forms of printmaking: monoprint, intaglio, woodcut, and silkscreen. The course begins with understanding image-making, using a matrix or indirect source, and then investigating drawing, line, shape, and tone through black and white imagery. Students will learn to create small editions of prints, multiple-color images, and large poster-size prints. Both traditional and contemporary techniques will be emphasized, using hand-printing methods as well as incorporating digital media. The course will also speak to the historical development of printmaking and its role and influence on today’s society. Field trips and guest speakers may be a part of the course to introduce students to movements in contemporary printmaking, from journalism to poster art. (Permission of the department chair is required.) "
  },
  {
    "name": "Textile Design",
    "dept": "Visual Arts",
    "notes": "(Half Course) ",
    "desc": "This course explores four major forms of printmaking: monoprint, intaglio, woodcut, and silkscreen. Both traditional and contemporary techniques will be emphasized, using hand-printing methods as well as incorporating digital media. Students will learn to create small editions of prints, multiple-color images, large poster-size prints as well as printing on fabric like repeat patterns and T-shirt designs. Experimentation will be encouraged! Through readings and discussions, this course will also speak to the historical development of printmaking and its role and influence on today’s society, from the Gutenberg Bible and Hokosai’s famous woodcut The Great Wave of Kanagawa to Warhol’s silkscreens of Campbell’s Soup Cans and John Wilson’s etching of MLK Jr. The course includes a field trip to a local printmaking studio to learn lithography or letterpress printing as well as a culminating DIY project. (Permission of the department chair is required.) "
  },
  {
    "name": "UX Design",
    "dept": "Visual Arts",
    "notes": "(Half Course) ",
    "desc": "This project-based introduction to the user interface design process is oriented toward practical methods for approaching a design problem for web-based and app design. The focus of the course is to develop conceptual designs based on the needs of users. Students will receive grounding in the following topics: digital design principles, user research methods, design sketching, and design validation aims. Students will cultivate and develop an appreciation for concepts and sensibilities of user experience design, and develop skills in the use and application of specific methods in user experience design. Lessons on design will include color theory, typology, and layout principles. Sketch and InVision will be used for wireframing and prototyping. Students will incorporate and improve individual and collaborative skills in design problem solving. (Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Portfolio: Drawing|Painting",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Class I ",
    "desc": "This is a seminar-based course for Class I students, designed to meet the individual needs of students with visual ideas they wish to explore in-depth in drawing, painting, and/or printmaking, through an extended series of works around a particular theme or concept. Most students will use this class to complete work for their college portfolios. Interested students may also complete the requirements for the Advanced Placement Studio Art: Drawing portfolio with continued study in the spring semester through the Advanced Portfolio: Independent Studio Seminar class. Working together in a classroom format, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: At least one, and preferably more than one, related advanced semester elective, or permission of the department chair.) "
  },
  {
    "name": "Advanced Portfolio: Sculpture|Ceramics",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Class I ",
    "desc": "This is a seminar-based course for Class I students, designed to meet the individual needs of students with visual ideas they wish to explore in-depth in sculpture and/ or ceramics, through an extended series of works around a particular theme or concept. Most students will use this class to complete work for their college portfolios. Interested students may also complete the requirements for the Advanced Placement Studio Art: 3-D Design portfolio with continued study in the spring semester through the Advanced Portfolio: Independent Studio Seminar class. Working together in a classroom format, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: At least one, and preferably more than one, related advanced semester elective, or permission of the department chair.) "
  },
  {
    "name": "Advanced Portfolio: Photography|Digital Imaging",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Class I ",
    "desc": "This is a seminar-based course for Class I students, designed to meet the individual needs of students with visual ideas they wish to explore in-depth in photography and/ or digital imaging, through an extended series of works around a particular theme or concept. Most students will use this class to complete work for their college portfolios. Interested students may also complete the requirements for the Advanced Placement Studio Art: 2-D Design portfolio with continued study in the spring semester through the Advanced Portfolio: Independent Studio Seminar class. Working together in a classroom format, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: At least one, and preferably more than one, related advanced semester elective, or permission of the department chair.) "
  },
  {
    "name": "Advanced Portfolio: Technology|Media",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Class I ",
    "desc": "This is a seminar-based course for Class I students, designed to meet the individual needs of students with visual ideas they wish to explore in-depth the creation of art with technology through an extended series of works around a particular theme or concept. Most students will use this class to complete work for their college portfolios. Interested students may also complete the requirements for the Advanced Placement Studio Art: 2-D or 3-D Design portfolio with continued study in the spring semester through the Advanced Portfolio: Independent Studio Seminar class. Working together in a classroom format, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: At least one, and preferably more than one, related advanced semester elective, or permission of the department chair.) "
  },
  {
    "name": "Advanced Portfolio: Filmmaking",
    "dept": "Visual Arts",
    "notes": "(Semester 1) Class I ",
    "desc": "This is a seminar-based course for Class I students, designed to meet the individual needs of students with ideas they wish to explore in-depth in film, through an extended series of works around a particular theme or concept. Most students will use this class to complete work for their college portfolios. Interested students may also continue their film study in the spring semester through the Advanced Portfolio: Independent Studio Seminar class. Working together in a classroom format, students will benefit from dialogue with each other, critiques, and field trips. (Prerequisite: Advanced Filmmaking, or permission of the department chair.) "
  },
  {
    "name": "Latin 1",
    "dept": "Classics",
    "notes": "",
    "desc": "This introduction to the Latin language presents the basics of grammar and vocabulary as well as background in Roman history, culture, and mythology. Because students start Latin with different backgrounds in English grammar, we devote considerable time to examining the way English works. In addition, students learn to look for English cognates of the Latin words they study, thus strengthening their vocabulary in both languages. Students are introduced to all five declensions; the six indicative tenses and the infinitives (active and passive) of all conjugations; relative, personal, demonstrative, and reflexive pronouns; the indirect statement; and the comparative system of adjectives and adverbs. Successful completion of this course qualifies students for Latin 2. Highly motivated and proficient students may request permission to enroll in the accelerated course, Latin 2/3. "
  },
  {
    "name": "Latin 2",
    "dept": "Classics",
    "notes": "",
    "desc": "Following a systematic review of Latin morphology and sentence structure, students in Latin 2 complete their study of forms and syntax while developing reading skills using adapted selections, primarily from Cicero. Starting in the spring, the course provides students with their first opportunity to read, in the native language, words written two millennia ago by authors who have influenced the development of Western literature and history. Some original Latin texts may serve as a starting point for exploring Greco-Roman mythology, culture, and important periods of Latin history. This course prepares students to read Latin prose. "
  },
  {
    "name": "Latin 3",
    "dept": "Classics",
    "notes": "",
    "desc": "A reading course with some grammar and composition, Latin 3 focuses on developing students’ reading skills. Students build vocabulary by identifying learned roots, prefixes, and English derivatives. Prose readings include selections from Caesar’s commentaries and the works of Cicero, which we examine for rhetorical literary style as well as for content and political implications. Excerpts from Ovid’s Metamorphoses and Amores introduce meter and familiarize students with mythological stories. Successful completion of this course qualifies students for Latin 4. Highly motivated and proficient students may request permission to enroll in the Advanced Placement course, Latin Literature. "
  },
  {
    "name": "Latin 2/3 (Accelerated)",
    "dept": "Classics",
    "notes": "",
    "desc": "This course combines all the grammar and authors studied in Latin 2 and 3. The class meets five times per week and assumes a solid foundation in level 1 Latin. Successful completion of this course qualifies students for Latin 4. Highly motivated and proficient students may request permission to enroll in the Advanced Placement course, Latin Literature. (Enrollment by permission of the department chair.) "
  },
  {
    "name": "Latin 4: Literature of the Golden Age",
    "dept": "Classics",
    "notes": "",
    "desc": "Students in this course develop their reading skills as they translate and engage with selections from first-century B.C.E. authors. Readings are drawn from Cicero’s speeches and/or letters, Ovid’s Metamorphoses, Vergil’s Aeneid, and other works of prose and poetry that are representative of the late Republican and Augustan age. These works introduce students to some of the most popular classical myths, to themes of love and the hero, and to the historical context that shaped the works. Students strengthen grammar skills, and increase reading speed and comprehension. They learn to scan dactylic hexameter and elegiac verse. This course introduces students to great works of Latin literature and prepares students for the Advanced Placement course, Latin Literature. "
  },
  {
    "name": "Latin Literature (AP)",
    "dept": "Classics",
    "notes": "",
    "desc": "This reading course focuses on Vergil’s Aeneid and the selections of Caesar’s Commentaries on the Gallic War that are included on the Advanced Placement examination. Students consider the major themes of the works within their literary and historical contexts. Designed for highly motivated students, this rigorous course presents elements of Roman history, politics, mythology, and the classical literary tradition. Through close textual study, students encounter literary criticism as a tool for understanding classical literature. (Permission of the department chair required; prepares students for the AP Latin examination.) "
  },
  {
    "name": "Advanced Latin: Roman Elegy & Lyric",
    "dept": "Classics",
    "notes": "(Half Course) ",
    "desc": "This course focuses on reading and understanding Latin poetry in its literary and historical contexts. Reading works by oets such as Catullus, Horace, Sulpicia, and Ovid; students trace the development of meter, diction, and poetic motifs. The class also explores how Roman poets adapted the conventions of love poetry to present an image of the Roman state under Augustus that is more personal than Vergil’s vision. Some important topics studied are first-person narrative, gender, and poetic allusion. (Prerequisite: Latin Literature (AP) or permission of the department chair.) "
  },
  {
    "name": "Advanced Latin: Roman Historians",
    "dept": "Classics",
    "notes": "(Half Course) ",
    "desc": "How did the Romans view their history? How did they want to be remembered? This course provides a look at Roman history through the eyes of some of Rome’s better known historians. A close reading of selected texts in Latin serves as a basis for examining questions of historiography and prose style. Principal selections are drawn from Livy, Tacitus, and Sallust. (Prerequisite: Latin Literature (AP) or permission of the department chair.) "
  },
  {
    "name": "Advanced Latin: Roman Philosophical Writings",
    "dept": "Classics",
    "notes": "(Semester 1) ",
    "desc": "What role did the Roman gods have in shaping the world around us? What does it mean to live “a good life”? In this course, students read selections from Lucretius, Cicero, Horace, and Seneca and examine their works for philosophical insight and poetic craft in their historical context. Students are introduced to important Greek influences on Roman philosophy. (Prerequisite: Latin Literature (AP) or permission of the department chair.) "
  },
  {
    "name": "Advanced Latin: Selected Readings",
    "dept": "Classics",
    "notes": "(Semester 2) ",
    "desc": "This course permits students to pursue their own interests in Latin and Greek literature at an advanced level. Working together with members of the department, students select authors and texts to read. Past classes have read comedy, satire, oratory, and history. (Prerequisite: Latin Literature (AP) and one other Advanced Latin course or permission of the department chair.) "
  },
  {
    "name": "Intensive Classical Greek",
    "dept": "Classics",
    "notes": "",
    "desc": "This course covers the basic grammar and vocabulary of Attic Greek. Adapted texts from Homer, Plato, Herodotus, and Aristophanes serve as a basis for the study of Greek culture and its legacy. Students also choose particular aspects of the Greek world to explore in independent and collaborative projects in the fall and spring. Some topics include democracy, art, drama, law, history, and philosophy. (Prerequisite: current enrollment in or completion of level 4 of a language at Milton.) "
  },
  {
    "name": "Advanced Greek: Plato",
    "dept": "Classics",
    "notes": "",
    "desc": "In this course, we continue the study of Greek grammar and syntax while reviewing the foundation built in the previous year. Students are introduced to Greek prose through a careful reading of selections from Plato’s Symposium, a text that serves as a basis for students’ study of 5th-century Athenian culture and identity. In addition to the Symposium, students study related passages from other Platonic works and from other authors and poets. Over the course of the year, students explore topics in mythology, history, philosophy, drama, gender, and sexuality. "
  },
  {
    "name": "Computer Science 1",
    "dept": "Computer Science",
    "notes": "(Half Course) ",
    "desc": "This project-based course is an introduction to computer programming. No prior knowledge of computing is needed. Using the development of video games, students learn the basic concepts of programming and the fundamentals of the Java programming language. Game topics covered include user control, decision-making, graphics, sound, character artificial intelligence, and animation. Students develop problem solving and logical thinking skills through object oriented programming and algorithm design. Second-semester projects allow students to explore more advanced topics and work on larger projects of their own choice. Past projects include writing multilevel video games, music composition software, and optical character-recognition software. The design and implementation of this course is unique, allowing students to master many basic concepts in programming while also developing compelling projects. "
  },
  {
    "name": "Computer Science 2",
    "dept": "Computer Science",
    "notes": "",
    "desc": "(Half Course or Semester 1 Course) This course is intended for students who have completed Computer Programming 1 or have learned equivalent material and received permission to enroll. It includes topics such as data structures, database programming, recursion, pathfinding algorithms, game AI programming, networking, graphical user interfaces, web programming, and control systems. The content and emphasis of the course are adapted each year to the interests and experience of the students. The course is taught using Java, PHP, and other languages. In recent years, students have written Internet network programs, studied artificial intelligence to fly a quad-copter (also built by students), created projects around Arduino and Raspberry Pi single board computers, and written games based on harvested Twitter data. (Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Computer Science: Applications",
    "dept": "Computer Science",
    "notes": "",
    "desc": "(Half Course or Semester 2 Course) This course exposes students to practical applications of programming. The focus is on developing applications for handheld devices (iPhone and Android). Other topics covered are based on student interest and emerging technologies. Students design applications for Android and then for iOS, learning the relevant material to do so. The coursework will use a variety of programming languages, including Swift, Java, SQL, and PHP. A recent class project is the Milton Academy Students application (available at Google Play and iTunes for free). (Permission of the department chair and prior programming experience are required. With departmental permission, this course may be taken concurrently with Computer Programming 2.) "
  },
  {
    "name": "Advanced Computer Science: AI",
    "dept": "Computer Science",
    "notes": "",
    "desc": "(Half Course or Semester 2 Course) This project-based course will introduce students to the basics of Artificial Intelligence (AI) and Data Science. We will cover many different types of applications in AI and AI concepts. Topics in the curriculum include k-mean square, logistic regression, perceptron, feed forward network, and convolutional neural networks. The class will do projects that cover clustering, binary classifiers, categorical classification, image classification, and natural language processing. Through all these projects students will get practice with curating and cleaning datasets. While students may choose to explore the mathematical depths of the AI concepts we discuss, they are not expected to learn more than just the most basic concepts within linear algebra necessary to understand machine learning models. "
  },
  {
    "name": "Perspectives: Genre & Culture",
    "dept": "English",
    "notes": "Class III ",
    "desc": "Examining texts grouped by genre to create a basis for comparison, students will explore major literary themes such as coming of age, tragedy, love, and the conflict between the individual and society. In class discussions and writing assignments, students will have opportunities to consider questions of how genre becomes part of a literary work’s cultural, historical, and social context and how different literary traditions give shape to (and are shaped by) the stories people tell one another. Recent reading lists have included short stories, novels, plays, and poems by authors such as Chinua Achebe, Edwidge Danticat, Terrance Hayes, Ernest Hemingway, Nella Larsen, Ada Limón, Tim O’Brien, and Charles Yu. "
  },
  {
    "name": "Founding Voices: Literature from the Ancient World through the Renaissance",
    "dept": "English",
    "notes": "Class III ",
    "desc": "This course will explore texts that have shaped the world’s literature and influenced writers and readers from early times to the present. Through units on epic heroes, drama, short-form poetry, and storytelling, we will discuss themes such as the hero’s journey, the ethical implications of cultural values, and the role of the individual in the world. After summer reading, the course will begin with Gilgamesh, the oldest story in the world, and will likely include texts such as Homer’s Odyssey, The Ramayana, The Sundiata, Dante’s Inferno, Tang Dynasty poetry, and The One Thousand and One Arabian Nights. "
  },
  {
    "name": "Performing Literature",
    "dept": "English",
    "notes": "Class III ",
    "desc": "This course explores how culture and society use literature to articulate, process, and address greater issues in contextual and modern settings. Through a mixture of classical and modern works, students will engage in a critical study of all genres of literature through several modes of performance, including oral interpretation, scene staging, poetry readings, and dramatic analysis. Through this mode of performance and discovery, students in Performing Literature will seek to glean not only a nuanced understanding of our texts but, through lifting them off the page, re-examine them in new light and through a three-dimensional lens. "
  },
  {
    "name": "Seeing Literature",
    "dept": "English",
    "notes": "Class III ",
    "desc": "From the imagery of a poem to the point of view of a short story or novel, literature often encodes important visual messages and commentary on human perspective in words. This course examines a diverse raft of literary works with special attention to the perspectival project within literature. With traditional books at the forefront, the course will also use paintings, films, and graphic novels to deepen understanding of the human complexities of seeing at the heart of each text as well as to embrace the reading and writing goals of the Class III curriculum. Titles may include The Handmaid’s Tale, Maus, and Persepolis. "
  },
  {
    "name": "Contemporary Literature in Context",
    "dept": "English",
    "notes": "Class II ",
    "desc": "This course guides students in approaching literature from a number of analytical lenses. Beginning with close reading—the detailed examination of a variety of texts for what the language will yield—the course moves to grouping texts by genre, by common theme, by historical period, and by a single author. In the late spring, the class applies all of these approaches to a single work, studying the text closely while also considering its form and theme, the period from which it came, and the influence of events in the author’s life. Past units include Hemingway, civil rights, the feminist movement, and the Vietnam War. "
  },
  {
    "name": "Literature and the Human Condition",
    "dept": "English",
    "notes": "Class II ",
    "desc": "Pursuing a broad inquiry into what makes us human, how we form relationships, how we make decisions, and how we live with their consequences, students examine literature from multiple traditions and genres. This discussion-based class delves into topics such as free will; heroism and villainy; self and other; and innocence, guilt, and redemption. Students explore their ideas about the course’s themes in critical essays, personal essays, and creative responses. Much of the fall encompasses John Milton’s epic poem Paradise Lost. Other writers in recent years have included Toni Morrison, Arundhati Roy, Charlotte Brontë, William Shakespeare, Matt Miller, and Haruki Murakami. "
  },
  {
    "name": "American Literature",
    "dept": "English",
    "notes": "Class II ",
    "desc": "This course offers a survey of American literature and encourages an exploration of American culture, past and present, through its literary figures. The form and content of the readings offer great variety, and students’ written responses range from literary criticism to creative imitations of styles. Texts will include The Scarlet Letter and Their Eyes Were Watching God as well as a wide selection of other classic and contemporary works. Students who have taken United States History in Class III or are taking it in Class II find that these courses complement each other. "
  },
  {
    "name": "People and the Natural World",
    "dept": "English",
    "notes": "Class II ",
    "desc": "This course explores varied human responses to the natural world through literature. We will read and discuss works of fiction, essays, personal narratives, and poetry as we consider the role of the natural world in literature, history, culture, and our own lives. Recent reading lists have included authors such as Louise Erdrich, Amitav Ghosh, Aimee Nezhukumatathil, Lauret Savoy, Patricia Smith, and Henry David Thoreau. Writing assignments will range from nature journals to essays of literary analysis and response papers. "
  },
  {
    "name": "Studies in English and American Literature 1: Lyric, Dramatic, and Epic Poetry",
    "dept": "English",
    "notes": "Class II ",
    "desc": "This course introduces students to major English and American poets, from the 8th century to the present, and to the styles of literary periods, including the Renaissance, the Enlightenment, the Romantic Period, and Modernism. The course begins with the major British texts which form the basis for all subsequent developments—including Beowulf, Shakespeare’s plays, and Paradise Lost. The course will study writers in cultural and historical context and will give special attention to how later writers “make it new” (in Ezra Pound's phrase) even as they draw on great works from the past. Designed as the first year of a two-year sequence, this class can also be taken as a stand-alone course in Class II. "
  },
  {
    "name": "Reading Consciousness",
    "dept": "English",
    "notes": "Class II ",
    "desc": "What makes us human? Is it our body, our soul, our consciousness? Through an interdisciplinary study of literature, philosophy, and religion, this course will investigate and interrogate our notions of humanity from antiquity to the contemporary era. By exploring topics such as the institution of slavery, the struggle for human rights, and the nature of spiritual transcendence, students will develop an understanding of the evolving definition of the human and insert their own voices into the current debate. Assessments may include critical essays, personal reflections, student led discussions, and creative work. Readings will come from a diverse range of authors and thinkers, including Ralph Ellison, Charlotte Brontë, Harriet Jacobs, Kazuo Ishiguro, and Plato. "
  },
  {
    "name": "The Craft of Nonfiction",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course is designed for students interested in the craft of writing as a means to express ideas, personal experience, and analysis of the sort of general interest topics (e.g., the arts, medicine, sports, nature, science, education) that appear in magazines such as The New Yorker and The Atlantic. It addresses three different genres of nonfiction: the feature article, a 4,000-word piece of investigative reporting; the essay of ideas, a 1,500-word reflective essay of ideas; and the memoir, a 4,000-word personal narrative. In each genre, students first read models and complete short, experimental writing assignments. The course differs from other Class I English courses in its high ratio of writing to reading and in its requirement that students revise each major piece of work to a high standard of professionalism. Critique by peers is an essential part of the writing process; students should expect to share their work with the class and to read and comment on the work of their classmates. "
  },
  {
    "name": "Fictions",
    "dept": "English",
    "notes": "Class I ",
    "desc": "We begin our journey with The Magus, the course’s required summer reading. On the island of Phraxos in 1953, the mysteries of Bourani become the thematic and artistic questions of the course. Exploring the myths, creeds, and psychological principles that we live by, we move from our encounters with freedom and truth to 19th- and 20th-century fiction. Continuing our historical and thematic exploration, we examine the fictions that people live by as we study modern and contemporary literature. Reading selections vary from year to year. The following is a sample of works taught recently: Body and Soul, Salvage the Bones, American Pastoral, Oryx and Crake, The Road, Beloved, and Exit West. "
  },
  {
    "name": "Intersectionality: Womanhood in American Culture",
    "dept": "English",
    "notes": "Class I ",
    "desc": "In the early 1980s, two key texts confronted our nation with a powerful question: If all the women are white, and all of the people of color are men, who is left out? The anthologies This Bridge Called My Back (1981) and Some of Us Are Brave (1982) highlighted the need for voices from women of color in feminist dialogue. It inspired legal scholar Kimberlé Crenshaw to coin the term “intersectionality”—a position at the cross-section of gender and race occupied by Black women in particular and, in more contemporary application, women of color in general. This interdisciplinary course in literature and feminist theory examines the interventions of American women who identify as Black, Latina, Native, and Asian into a discourse that excluded them through identity and class. It also considers how those interventions redefine American feminism for not only women of color but also their white counterparts. Assessments will include critical essays, personal reflections, and creative work. In addition to the anthologies and the writing of Crenshaw, readings may also include works from Audre Lorde, Yuri Kochiyama, Gloria Anzaldúa, Adrienne Rich, and Louise Erdrich. "
  },
  {
    "name": "Literature & the Nature of Reality",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course looks at a variety of texts that explore, question, and prod at the boundaries of the nature of reality. In studying novels, plays, movies, short stories, and poems, we look not only at ideas in literature, but also at theories in psychology, science, morality, language theory, and art. The class is divided into thematic units, though many texts will cross from one theme into others. Central to the class are the big questions: What is real? How do we judge reality? How and why does literature explore it? Possible authors include Samuel Beckett, Jorge Luis Borges, Toni Morrison, Michael Frayn, Tony Kushner, Luigi Pirandello, Adrienne Rich, Tom Stoppard, and Virginia Woolf. "
  },
  {
    "name": "Modern Comparative Literature",
    "dept": "English",
    "notes": "Class I ",
    "desc": "“The center cannot hold,” as W.B. Yeats writes. Modern Comparative Literature explores modernism, “a revolutionary movement encompassing all of the creative arts that began in the late 19th century and continued into the 20th...Modernist authors sought to break away from traditions and conventions through experimentation with new literary forms, devices, and styles... Their works reflected the pervasive sense of loss, disillusionment, and even despair in the wake of the Great War” (The Bedford Glossary of Critical and Literary Terms). Using a set of contextual authors and readings, students read modernist authors such as Kafka, Joyce, Woolf, Faulkner, Camus, Garcia Marquez, and Morrison with an eye toward modernist themes and ideas. The course starts with a focus on prose before shifting to a study of 20th century plays in the spring. Amidst the alienation and destruction, how hopeful do the artists that we encounter allow us to be about our future? While “things fall apart” is there, as Garcia Marquez posits, “a new and sweeping utopia of life, where no one will be able to decide for others how they die, where love will prove true and happiness be possible, and where the races condemned to one hundred years of solitude will have, at last and forever, a second opportunity on earth?” Or does the art we encounter foresee our inevitable destruction? "
  },
  {
    "name": "Philosophy & Literature",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course investigates theories about the nature of humanity and moral philosophy, emphasizing a reasoned approach to thinking about complex and abstract problems. Topics include the basis of human knowledge, questions of freedom and determinism, the nature of evil, the nature of moral and aesthetic judgment, and the definition of social and political justice. Each unit takes its form around a main literary text and complementary philosophical readings. Students read traditional philosophers such as Plato, Aristotle, Descartes, and Kant, as well as more modern thinkers such as Marx, Nietzsche, and Freud. Titles may include Alan Lightman’s Einstein’s Dreams, Primo Levi’s The Drowned and the Saved, Cormac McCarthy’s No Country for Old Men, Fyodor Dostoevsky’s Crime and Punishment, and Colson Whitehead’s The Nickel Boys. "
  },
  {
    "name": "Shakespeare and Cinema: Sex, Race, Religion, Power",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course invites students to study six of Shakespeare’s major plays alongside multiple film adaptations of each. We will historicize Shakespeare in terms of an early modernity where old ideas mixed, often radically, with new ones, and where concepts whose meanings we take for granted—such as those involving sexuality, gender, race, religion, and the nature and exercise of political power—were wildly unstable. These instabilities appear in the plays as aesthetic ambiguities. They speak to what Ngũgĩ wa Thiong’o calls Shakespeare’s “revolutionary spirit” and what Emma Smith refers to as his “gappiness,” which makes the plays “alive in unpredictable and changing ways.” Infamously used as a tool of the British empire in 19th and 20th century colonial education, the plays have also proven “alive and unpredictable” as immensely generative artistic templates for writers and filmmakers from around the world to adapt, translate, and reimagine Shakespeare for their own aesthetic and political situations. A cross-dressing Hamlet in progressive Weimar Germany; The Tempest staged in an all-women’s prison; Heath Ledger and LL Cool J as ’90s Petruchios; King Lear in the conventions of Japanese Noh theater; the rebellion of Laertes as a grassroots uprising in postcolonial Ghana—these pairings among others speak to the leaps we will make across histories, languages, cultures, and artistic mediums in Shakespeare and Cinema. Students will write critically about the plays and will be encouraged to develop final projects that creatively adapt Shakespeare in a medium of their choice. "
  },
  {
    "name": "Studies in English and American Literature 2: Fiction and Prose",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course, which continues the combined study of British and American writers established in English and American Literature 1, introduces students to major English-language writers of prose—fiction, drama, and essays—from Geoffrey Chaucer to Toni Morrison. The course will study writers in cultural and historical context and will give special attention to the history and development of the novel from its origins in the 18th century to the formal innovations of Modernism. We will read authors such as Swift, Austen, Brontë, Dickens, Emerson, Douglass, Wilde, Woolf, Faulkner, and Miller. This course is designed to complement Studies in English and American Literature 1: Lyric, Dramatic, and Epic Poetry as a two year sequence, but students who took other electives in Class II can also choose this course in Class I. "
  },
  {
    "name": "Themes in Contemporary World Literature",
    "dept": "English",
    "notes": "Class I ",
    "desc": "In this course, we read 21st-century texts that pose challenging questions about the global context in which we live today. Themes we explore have included public health, globalization, citizenship, the climate crisis, immigration, colonization, and identity. Because of the contemporary nature of this course, readings change frequently. Students may expect to read texts from at least four different regions within the year. Regions include but are not limited to the Caribbean, South Asia, East and Southeast Asia, West Africa, South America, Native American nations, and the Middle East. Assessments in this course offer students choice in their style of writing and self-expression and will focus on developing skills in voice, revision, and self-directed work. "
  },
  {
    "name": "Living Writers",
    "dept": "English",
    "notes": "Class I ",
    "desc": "This course will offer students the unique opportunity to study living writers shaping the literary world. Each year, the list of authors will include our two Bingham visiting writers, who will visit the class to engage directly with students. By limiting the number of writers we study, this course will allow students to examine each writer more intensively than is possible in other courses: students might, for example, follow the evolution of an author’s style and choice of subject matter and theme; explore an author’s approach to different literary genres; or place an author within a literary tradition. Students will also have a chance to craft the course curriculum by collectively selecting at least one author to study during the year. Written work will include both critical essays and creative pieces, perhaps using as inspiration the style or thematic content of the works being studied. The following list names former Bingham writers in recent years, suggesting the stature of the living writers likely to be chosen: Zadie Smith, Junot Diaz, Edwidge Danticat, Lauren Groff, Paul Muldoon, Jamaica Kincaid, Tracy K. Smith, Terrance Hayes, Tina Chang, Jenny Xie, John Edgar Wideman, Paul Yoon, Mark Doty, Lorrie Moore, Claire Messud, Patricia Smith, Gish Jen, Kamila Shamsie, Amy Hempel, Martin Espada, Kevin Young, and Richard Blanco. "
  },
  {
    "name": "Ancient Civilizations: History of Humanity to 1250",
    "dept": "History & Social Sciences",
    "notes": "Class IV ",
    "desc": "This course serves as an introduction to the study of history. It examines a wide range of societies across the world from East Asia to Western Europe to sub-Saharan Africa. Readings focus on the effects of geography, on the growth of societies, the interaction of cultures, and the evolution of social and political institutions, religion and philosophy. Students read a significant number of primary sources as well as secondary accounts and interpretations. The course emphasizes building analytical thinking, and reading and writing skills. In the spring semester, students conduct a major project in library research. This course is designed for Class IV students who have received credit for Modern World History, and/or students who want a global history course in preparation for taking the two-year sequence, United States in the Modern World. "
  },
  {
    "name": "World History: Challenges & Changemakers",
    "dept": "History & Social Sciences",
    "notes": "",
    "desc": "Classes II, III, & IV This course emphasizes core historical thinking skills while covering a wide range of topical global content. Students will explore human stories from the distant and near past, and will trace their impacts on the present, engaging with primary and secondary source material and utilizing these texts to make cogent historical arguments. This course encourages critical analysis and the asking of generative questions about point of view, causality, comparison, change, and continuity. This practice in inquiry will culminate in a month-long research project on a topic of each student’s choosing. "
  },
  {
    "name": "United States History",
    "dept": "History & Social Sciences",
    "notes": "",
    "desc": "Conceptual and interpretive in nature, this course examines both the important documents (e.g., Declaration of Independence, United States Constitution, Gettysburg Address, and speeches of Frederick Douglass, Susan B. Anthony, Martin Luther King Jr., and John F. Kennedy) and the multiple historical interpretations of an event or personality in the American past. Looking at the tension between freedom and order, democracy and slavery, urbanization and populism, gender and politics, localism and nationalism, students begin to see and understand that the principles and ideas fought for at the time of the American Revolution are unresolved in the later 19th and 20th centuries. Students will complete a major library research project in the spring semester. (Prerequisite: World History: Challenges & Change Makers) "
  },
  {
    "name": "The United States in the Modern World 1 and 2 (two-year sequence)",
    "dept": "History & Social Sciences",
    "notes": "",
    "desc": "Note: The United States in the Modern World 1 and 2 courses must be taken sequentially in either Classes III and II or Classes II and I. "
  },
  {
    "name": "The United States in the Modern World 1",
    "dept": "History & Social Sciences",
    "notes": "Classes II & III ",
    "desc": "This course tells the story of economic and political revolution—where its origins lie in the 15th and 16th centuries, how it is carried out in the 17th and 18th centuries, and how it re-shapes the world in the 19th century. Students will study the modern history of the great empires of Eurasia, encounters between the peoples of Europe and the Americas, expansion of trade and technology, and the development of political ideologies. The American experience, from the voyages of Columbus to the Civil War, will be placed within the larger context of the modern world. Students will complete a major library research project in the spring semester. "
  },
  {
    "name": "The United States in the Modern World 2",
    "dept": "History & Social Sciences",
    "notes": "Classes I & II ",
    "desc": "The United States takes a central role in the second year of this course, beginning with the impact of the Civil War and industrialization on both domestic and foreign policies. Questions of new thought in social relations, in the application of science and technology, and in governmental roles and responsibilities in the United States and in selected other nations will be studied, so that the discussion of revolutionary change begun in the first year continues and broadens. A close consideration of several Cold War topics in the second semester will enable students to reach a greater understanding of the problems faced by the 21st-century world, in particular the impact of human history on the natural world. Students will complete a major library research project early in the second semester. "
  },
  {
    "name": "African-American History",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) ",
    "desc": "In this course, students examine the African American experience with an emphasis on individual and collective agency, political protest, and efforts to initiate social change. The course is organized chronologically. Students begin their study in 15th-century Africa before moving quickly to the trans Atlantic slave trade, and the historical foundations of Black life in the antebellum and postbellum periods. The second half of the course stresses more contemporary issues of the 20th and 21st centuries. Throughout, students will grapple with questions that pertain to isolation and identity; individualism and collectivity; race and struggle; resistance and joy; and African American history as United States history. "
  },
  {
    "name": "History of Modern China",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) ",
    "desc": "Since the late 20th century, China has been the most dynamic country. After suffering national decline, famines, foreign invasions, and domestic chaos, China has re-emerged as a confident, powerful, and influential country. Boasting the world’s second-largest economy, China is beefing up its military, buying up natural resources and influence worldwide, and staking its flag in faraway places like the South Pole and closer to home in the South China Sea. Foreign governments eagerly accept Chinese investments across a wide range of industries, but they also complain about Chinese trade practices and attitudes. The Belt and Road Initiative (BRI), a signature Chinese global project under the Xi government worth approximately $6 trillion, is both an example of China’s vision and a testament to its ambition. The initiative is designed to tie China’s economy to the rest of the world by developing a series of multinational railway systems, airports, and deep-water ports that stretch from China all the way to Western Europe. With trade, China hopes to bring about mutual economic development and prosperity. All this sounds wonderful, but critics of BRI point to a series of problems ranging from unfair Chinese trade practices and environmental degradation to corruption. So what is the real picture of today’s China? Is it a benign and rapidly developing power ready to take on the mantle as a defender of the global economic order? Or is it a neo-colonial upstart with a mercantile streak ready to exploit others for its own benefit? The truth lies somewhere in between, and we will use this course to uncover some of the major issues at stake. We will examine them critically using a historical lens so that China’s position, perspective, and motivation can be better understood. "
  },
  {
    "name": "History of the Middle East",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) ",
    "desc": "This course examines the history of the Middle East from 1900 to the present. The geographic focus will be Egypt, Iraq, Iran, Israel, Saudi Arabia, and Turkey. We will keep two broad questions in mind as we follow the current political and social developments in the region: 1) What impact did Western imperialism and the process of decolonization have on society and politics in the Middle East? and 2) How did the U.S. invasion of Iraq in 2003 start a process that has led to a reordering of the modern Middle East? Students will conduct individual research on the topics of their choice at the end of the semester. For students wanting to continue their study of the contemporary Middle East, the course of Globalization and Islam in the second semester builds on themes covered in this course. "
  },
  {
    "name": "Topics in Modern World History: In the Aftermath: Case Studies in Transitional Justice",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) ",
    "desc": "What should happen after a government’s violence against its citizens? Who should decide? The class will focus on specific case studies to explore three kinds of responses to government crimes against citizens: the policies of official forgetting (e.g., post-Franco Spain; Argentina); truth telling and reconciliation movements (e.g., post-apartheid South Africa; Australia); international prosecutions (e.g., Khmer Rouge in Cambodia); and reparations (e.g., Canada/First Nation Peoples; U.S. government/slavery). We will also explore responses from artists, filmmakers, theologians, psychologists, and survivors to understand the challenges and promise of transitional justice. Projects will include persuasive and analytical writing along with training for and practice of interviews, mediation, and mock trials. "
  },
  {
    "name": "Asian American History",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) ",
    "desc": "Asian Americans constitute the fastest growing population in the United States. Students will explore the history of this diverse community from 1850 to the present. Throughout this period, Asian Americans have been characterized as either the “model minority” or the “yellow peril.” By focusing on the experiences of Chinese, Japanese, Korean, Filipino, Asian Indian, and Vietnamese Americans, students will develop a dynamic understanding of the documentation and interpretation of this history. Documentary films and readings about immigration policy, international relations, labor history, community development, and political empowerment will be the focus of our studies. Students will conduct an oral history project at the end of the semester. "
  },
  {
    "name": "The Aztecs to High-Tech: A History of Latin America & the Caribbean in the World",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) ",
    "desc": "Drug trafficking, poverty, and political revolution. These are just a few of the images that the mention of Latin America and the Caribbean conjures. Not inaccurate, these images are also easy generalizations that obscure the realities of a region rich in history, and social and cultural complexities that have profoundly contributed to the entire pageant of humanity. This course examines that complicated, historical process. Arranged chronologically and thematically, it begins with the earliest Indigenous communities and concludes with an exploration of the region’s role as a provider of cheap labor for technologically sophisticated multinational corporations like Ford and Motorola. The course deliberately integrates a global perspective that challenges students to consider the ways the people of Latin America and the broader world have shared mutually constituted historical experiences. "
  },
  {
    "name": "Globalization & Islam",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) ",
    "desc": "This course will explore the relationship between globalization and the Middle East in the post-9/11 world. Using readings from current scholarship, we will examine ways in which the Arab world has been shaped by economic, political, and social realities created by globalization. The first part of the course will introduce students to broad topics in globalization. Then we will apply these theories to our case studies of Egypt and Jordan. The third part of the course will focus on the complex relationship between globalization, American foreign policy, and the rise of religious extremism in Europe and the Middle East. To better connect our classroom learning to the Middle East, students will work with a nongovernmental organization in Jordan to create a final project that helps raise awareness of issues related to the Syrian refugee crisis. This course frequently offers an optional trip to Jordan during the March vacation. "
  },
  {
    "name": "History of Civil Rights",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) ",
    "desc": "In this course, we will examine a number of questions about the struggle for justice and equality in the United States. What did the civil rights workers of the 1960s hope to accomplish? What were they able to achieve? How did American society respond to this movement for social change? The first half of the course is devoted to understanding the relationship between oppression and resistance, focusing on the legacy of segregation. Students will then look at the events that shaped the modern civil rights movement. Course work includes journal writing, reaction papers, and a final research project about a contemporary civil rights issue. This course challenges students to develop a clear historical perspective about one of the most revolutionary periods in U.S. history. "
  },
  {
    "name": "Cold War America",
    "dept": "History & Social Sciences",
    "notes": "",
    "desc": "(Semester 1 or Semester 2) The Cold War was the crucible by which the United States was transformed into a global superpower, and it laid the basis for the national security state. The ideological competition between the United States and the Soviet Union shaped the global and regional makeup of the modern world and its legacies continue to influence global politics in the 21st century. This course charts the Cold War through the lens of the Berlin Wall era (August 1961 to November 1989) and provides an overview of the ideological and social/cultural drivers of the conflict. The course concludes with charting how the Cold War wound down with the crumbling of the Berlin Wall and the legacies it has left for the 21st century and beyond. It will provide students with an overview and general survey of the key developments of the period from 1960 to 1990. "
  },
  {
    "name": "Historical Archeology",
    "dept": "History & Social Sciences",
    "notes": "(Half Course) ",
    "desc": "This course will start with a study of what is historical archeology—how do historians understand the past 400 years of history by examining and studying physical objects and documents? This is a project-based course designed to allow students to use the tools of historical archeology to study the town of Milton by studying colonial-era graves, and examining historical documents to understand what they tell us about colonial Milton. We will use this study of Milton cemetery graves to study who is present and who is missing from history. Students will design a project to unearth the history of African Americans and Indigenous people in Milton, Boston, and Massachusetts through a study of war, monuments, and propaganda documents from the colonial period. "
  },
  {
    "name": "American Government & Politics (Semester 1)",
    "dept": "History & Social Sciences",
    "notes": "Classes I & II ",
    "desc": "The heart of this course is an examination of the interactions between the policy making institutions of the United States government (Congress, the presidency and the executive branch, and the Supreme Court) and the nature of American political parties, interest groups, the media, and the American electoral practices. With a focus on current events, we will begin to see how the United States’ constitutional underpinnings are enforced and complicated by political culture. Through this course, students will be engaged in following political events in and out of the class as well as partaking in independent research as a way to understand and contribute to political processes. Ultimately, this course will equip students with the foundational understanding to engage thoughtfully and purposefully in politics, while also allowing for the practice of political communication and discourse— all of which are incredibly important in our increasingly polarized political climate. (Note: To enroll in this course, students must have taken or be taking United States History or The United States in the Modern World.) "
  },
  {
    "name": "Comparative Government",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "In this course, we will develop the skills and habits of mind required to study and thoughtfully participate in our global political landscape. Through concrete historical and present-day examples, we will analyze the current literature and theoretical basics of comparative politics, and question why governments and institutions take the forms they do. We will ground our conversations in case studies from states around the world. In doing so, we will address two essential questions: What defines and complicates democracy? And how does change occur and endure? By questioning the legitimacy of governments, the distribution of power, and the roles of culture, leaders, and institutions, we will use history to explain current trends and make future predictions. Ultimately, every aspect of the course will culminate in project-based assessments that apply comparative politics to the case of the Arab Spring. "
  },
  {
    "name": "Microeconomics: The Power of Markets",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1 or 2) Classes I & II ",
    "desc": "This course studies the behavior of individual firms and households within specific markets, like health care, the automotive industry, and retailing. It covers such economic concepts as scarcity, opportunity cost, supply and demand, elasticity, price, and economic efficiency. Focused on the interactions within different markets, the course examines both competitive and non-competitive structures and explores the consequences of market failures. As we explore how markets operate, we will pay particular attention to a company’s costs, labor markets, capital markets, and government regulation. (This course will prepare students for both Macroeconomics and Behavioral Economics. Students may not take this course if they have taken, or are planning to take Calculus and Applied Economics.) "
  },
  {
    "name": "Macroeconomics: The Federal Government and the National Economy",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1 or 2) Classes I & II ",
    "desc": "This course focuses on the whole U.S. economy. It covers such economic concepts as gross domestic product, economic growth, unemployment, inflation, and trade. Economic models for a market-based national economy are examined; topics of discussion include GDP growth, fiscal policy, monetary policy, the Federal Reserve, and taxation. We will also spend some time discussing the U.S. economy in the context of the global marketplace and tackle issues of international trade, trade policy, and sustainable development. (This course will prepare students for Behavioral Economics.) "
  },
  {
    "name": "Economic Inequality: The Study of Race, Class, & Gender in the U.S.",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "The United States is at a tipping point in its history. The rich are getting richer while others are poverty-stricken. The United States has firmly established a de facto caste system as gender equality has regressed and extreme discrimination and racial animosity remain at the center of the American narrative. So, what happened to the “American Dream?” Why is there still so much racism and nativism in America? How can a country so rich have so much poverty? What were the causes of this tragedy and what could be some possible solutions? This course will tackle these challenging topics and address these questions and many others in hopes to find a path for a better and more harmonious future. (Prerequisite: United States History or The United States and the Modern World II.) "
  },
  {
    "name": "Global Economics: Inequality, Capitalism, & Sustainable Development",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "This course aims to explore the relationship between inequality, globalization, and economic growth. More specifically, the course is designed to answer the questions of why certain nations are able to adopt institutions and policies that promote equality, and under what conditions, economic, social, and political capital fosters growth and a sustainable future. How can global poverty be eradicated? What are some of the structural transformations, shifting modes of thought, dynamics of class, race, gender, ethnicity, and geographic stratification that shape the debate around global inequality? This course relies on basic principles of economic theory to analyze economic realities and policies in the U.S. and abroad with a particular focus on the impact of inequality on social justice and democracy. "
  },
  {
    "name": "Behavioral Economics: The Burdens of Decision-Making",
    "dept": "History & Social Sciences",
    "notes": "(Semester 2) Classes I & II ",
    "desc": "This course explores the relatively new field of behavioral economics and works to revise standard economic models of human behavior by integrating psychology and economic thought. We will quickly discuss and dissect conventional economic theory and use that as a jumping off point to answer questions of behavior such as: How do people make decisions on what cereal to eat? Why do people feel more comfortable paying a dinner bill with a credit card instead of cash? What are the roles of altruism, equity, and fairness in our society and world? We will discuss these questions and many others throughout the semester. This course relies on the basic principles of economics to understand human decision making. (Prerequisite, one of the following: Microeconomics, Macroeconomics, Calculus and Applied Economics, Psychology Seminar or Topics in Psychology.) "
  },
  {
    "name": "Psychology Seminar",
    "dept": "History & Social Sciences",
    "notes": "(Full Course) Classes I & II ",
    "desc": "This college-level course introduces students to the field of psychology, the scientific study of the mind and behavior, through hands-on experiences with research design, projects, discussion, and lessons. In addition to learning about major areas within the field of psychology—including cognition, neurobiology, development, behaviorism, socioculturalism, and mental health—students will often be required to work in teams and expected to improve their observation, leadership, collaboration, and presentation skills. Students will work toward thinking like a psychologist where they reflect critically about the theories and research presented and thoughtfully consider the human experience and the carrying influences on it. Although it is not required, students may find it helpful to have taken or be taking biology and statistics. (Topics in Psychology is not a prerequisite for this course; students may not take this course if they have taken, or are planning to take Topics in Psychology.) "
  },
  {
    "name": "Topics in Psychology",
    "dept": "History & Social Sciences",
    "notes": "(Half Course) Classes I & II ",
    "desc": "This course explores topics within the discipline of psychology, including development, personality theory, abnormal psychology, social psychology, and learning. Through these topics, students also study the thought of foundational and contemporary theorists within the field of psychology. Course content integrates reading from the textbook and primary sources as well as watching film from a psychological perspective. Students are encouraged to reflect on the material in both personal and academic ways and are evaluated through interactive learning projects, analytical essays, and classroom discussions. (Students may not take this course if they have taken, or are planning to take Psychology Seminar.) "
  },
  {
    "name": "Activism for Justice in a Digital World",
    "dept": "History & Social Sciences",
    "notes": "(Half Course) Classes I & II ",
    "desc": "How do activists work to create a more just society in the United States and in the world? How are they combining new social media tools and traditional service activities to address problems of poverty, homelessness, hunger, educational inequity, health care, the environment, and immigration? How can you make a difference? This course will explore current issues through readings by contemporary authors and news sources as well as historical documents, speakers, and field trips into Boston. An integral component of this exploration will be students’ firsthand experiences through weekly service commitments to local sites (with homework time allocated to this hands on work). Course work includes journal writing, short papers, and action projects. "
  },
  {
    "name": "Religions of the Middle East",
    "dept": "History & Social Sciences",
    "notes": "(Semester 1) Classes I & II ",
    "desc": "The Middle East is the birthplace of three of the world’s great religious traditions— Judaism, Christianity, and Islam. It is also a center of conflict, often stemming from religious differences. In our shrinking and pluralistic world, having knowledge of religion has become increasingly important in order to be an informed citizen. Taking a global and historical view, this course examines the development of each of the Middle Eastern religions, analyzes their connections, and contemplates the source of their tension. Students will study each religion on its own terms through class discussion, primary texts, film, and inquiry into the spiritual and religious practices of each tradition. "
  },
  {
    "name": "Proof & Problem Solving",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course aims to teach students how to solve problems they’ve never encountered before, how to analyze scenarios, and identify the tools they possess to answer the question or produce a solution; in other words, this course prepares students for the rigors and joys of the Milton mathematics curriculum. As part of this work, we cover general skills needed in high school, including note taking, reading and writing mathematics well (including proof), what it means to justify one’s reasoning, and we emphasize the standards of work and communication for math courses at Milton. Students access information through a variety of media, and do hands-on work as well as using pencil and paper. They learn programming through several week-long units when computer science teachers spend time with their classes. Students learn to read technical textbooks and standardized test material as well as articles from a range of mainstream publications. We use an ever evolving collection of online resources and tools that facilitate development of abstract thinking and creative problem solving. While we do cover traditional algebra and geometry topics, students may also choose to work on producing beautifully formatted mathematical work using LaTeX, the decision-making processes in board game play, the mathematics of folding through origami, their knowledge of coding, or investigating math in the context of social justice, to name just a few examples. Access to more sophisticated options, with the goal of gaining exposure to what advanced mathematics looks like in college and beyond, serves every student. Critical thinking skills underlie our content choices as we provide all students with the tools they will need to be successful in mathematics courses. "
  },
  {
    "name": "Algebraic Concepts (Honors, Regular)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course builds upon the foundation developed in Algebra 1 and Proof & Problem Solving, extending students’ knowledge and understanding of algebraic concepts, and introducing them to work with real-world mathematical models. The course includes visual and symbolic analyses of linear, quadratic, and exponential functions as well as exponents, logarithms, sequences and series, optimization, transformations, and triangle trigonometry. Other topics may include introductions to conic sections and the properties of real and complex numbers. Students will continue to develop their ability to communicate mathematically, with a more directed focus on identifying and representing mathematical ideas in equivalent yet different ways by exploring the algebraic, graphical, numerical, and verbal representations of concepts. (Prerequisite: Proof & Problem Solving) "
  },
  {
    "name": "Advanced Functions (Honors, Regular)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course examines the structure, application, and connections between polynomial, exponential, logarithmic, and trigonometric functions, along with rational functions and limits. The course also considers some discrete math topics, which may include combinatorics, probability, an introduction to statistics, and economics. Projects will allow students to pursue particular interests and see real-world connections. Goals of this course include building critical thinking and mathematical communication skills. (Prerequisite: Algebraic Concepts) "
  },
  {
    "name": "Calculus (Honors, Regular)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "In this course, students use limits of infinite processes to develop differential and integral calculus; they then use these concepts to create mathematical models. The abstract properties of elementary functions are re-examined in light of these new techniques; problems drawn from the natural and social sciences provide opportunities to apply these new concepts. (Prerequisite: Advanced Functions) "
  },
  {
    "name": "Calculus & Applied Economics (Honors)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This class will introduce students to the essentials of single variable calculus and the principles of economics. Students will explore the central concepts of calculus: limits, derivatives, integrals, and the Fundamental Theorem while emphasizing applications to economics. The course will also illuminate the central concepts of economics, particularly microeconomics. Economics is the study of the way consumers and producers interact in markets, and the economic way of thinking centers on cost benefit analysis. The course will use the tools of calculus to model consumer and producer behavior and to analyze the social welfare effects of government policies. (Prerequisite: Advanced Functions. Students may not take this course if they have taken, or are planning to take Microeconomics.) "
  },
  {
    "name": "Calculus (Accelerated)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This is a rapid-paced course for students who thrive in fast, intensive mathematical settings. This course uses limits of infinite processes to study rates of change and areas under curves. We will re-examine abstract properties of elementary functions in light of these new techniques. Problems drawn from the natural and social sciences provide opportunities to apply these concepts. Additional topics include infinite series, parametric equations, and an introduction to differential equations. In this course, students complete the study of a year and a half of Calculus in one year. (Prerequisite: Advanced Functions Honors and permission of the department chair.) "
  },
  {
    "name": "Statistics (Honors, Regular)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "Statistics is the science of collecting, organizing, and interpreting data. Students in this course learn how to analyze data from existing data sources as well as data collected from student-designed surveys and experiments. Students will also learn the importance of randomization in the collection of data and critique the validity of third-party data. This course investigates the underpinnings of probability theory, random variables, and probability distributions as the basis for inferential statistics. Finally, students will apply all of these techniques to real-world and self-designed studies. Students gain mastery using a variety of technologies. (Prerequisite: Algebraic Concepts and Advanced Functions, which may be taken concurrently.) "
  },
  {
    "name": "Advanced Statistical Methods (Honors)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course will begin with a brief review of the four stages of the statistical process that are learned in Statistics: producing data, exploratory data analysis, probability theory, and statistical inference. From there, students will explore more advanced statistical topics, including linear regression, multiple regression (including inference and variable selection), logistic regression, one-way and multi-factor ANOVA, non parametric methods, bootstrapping, and time series analysis. The learning of these concepts will be accompanied by hands-on exploration, including using the free statistical software program R. Throughout the year, students will conduct a variety of research projects and will be encouraged to engage in cross-curricular exploration and utilize real-world data in their analysis. Students should be interested in collaborating with their peers, working on long-term projects, and grappling with serious inquiries about the world around them. (Prerequisite: Statistics and Calculus, which may be taken concurrently.) "
  },
  {
    "name": "Advanced Calculus & Mathematical Statistics (Honors)",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course explores the deep and rich world of mathematical statistics, with an emphasis on explaining and showing how and why things work using calculus. The course covers combinatorics, probability, and random variables (both discrete and continuous) and offers choice about additional ideas, including game theory, stochastic processes, inference, and hypothesis tests. No prior formal statistics is required, as concepts are taught when needed (or reviewed and extended for those who have studied statistics before). There is also an emphasis on exploration and agency in project work. (Prerequisite: Calculus) "
  },
  {
    "name": "Multivariable Calculus",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course will cover topics in multivariable calculus, including vectors, vector functions, partial derivatives, multiple integrals, and vector calculus. Additional advanced topics may be included, at the discretion of the instructor. (Enrollment by permission of the department chair. With departmental permission, this course may be taken concurrently with Advanced Calculus and Mathematical Statistics (Honors). ) "
  },
  {
    "name": "Linear & Abstract Algebra",
    "dept": "Mathematics",
    "notes": "",
    "desc": "This course is a proof-oriented introduction to the study of concrete categories such as sets, groups, abelian groups, fields, and vector spaces, focusing on the morphisms (functions), sub-structures, quotients, and actions within each category. Within Abstract Algebra, topics include Lagrange’s Theorem, Cayley’s Theorem, The Isomorphism Theorems, and possibly Sylow’s Theorems. Within Linear Algebra, the course will focus on coordinate vectors, dimension, matrix representations of linear transformations, change of basis, determinants, and possibly eigenvectors. Specific attention will be given to the interplay between categories, which may involve the study of diagrams and functors. Linear Algebra will be applied to the study of Linear Differential Equations. Nonlinear Differential Equations may also be pursued, based upon student choice. (Enrollment by permission of the department chair. With departmental permission, this course may be taken concurrently with Calculus.) "
  },
  {
    "name": "Advanced Topics in Mathematics",
    "dept": "Mathematics",
    "notes": "",
    "desc": "(Semester 1, Semester 2) This course permits students who have already studied calculus and statistics to pursue explorations in the field of mathematics at an advanced level. Topics may include number theory, topology, combinatorics, field theory, game theory, or graph theory. Designed to meet the needs of the students with mathematical ideas they wish to explore in depth, this course is a seminar-style exploration of a particular field. (Prerequisite: Calculus and Statistics, and permission of the department chair.) "
  },
  {
    "name": "Discrete Mathematics Seminar",
    "dept": "Mathematics",
    "notes": "(Half Course) ",
    "desc": "Students will study introductory graph theory and combinatorics, which are the foundations for understanding a wide range of problems in probability, computer programming, and discrete applied mathematics. Students will use specific motivating questions to direct topic exploration. Motivating questions include: What is the fewest number of colors necessary to color a map of the United States so that any pair of neighboring states are different colors? If a five-card poker hand is chosen at random, what is the probability of obtaining a flush? Can a knight move around a chessboard, landing on every square exactly once? These questions are limited to the use of discrete number systems (e.g., the counting numbers and the integers). Specific topics may include planar graphs, Euler cycles, Hamilton circuits, coloring theorems, trees, permutations, combinations, and recursion. Classwork will include numerical problems as well as introductory logical proofs. (This course may be taken concurrently with Algebraic Concepts or Advanced Functions only.) "
  },
  {
    "name": "Mathematics & Art",
    "dept": "Mathematics",
    "notes": "(Half Course) ",
    "desc": "From Penrose tiling and M.C. Escher’s work to Mandelbrot and Julia sets to Margaret Wertheim’s crocheted coral reef and Frank Gehry’s oeuvre, mathematical art and artistic mathematics both transform our world and help us make sense of it. Students will work in a range of media from digital design and origami to knot theory and fiber arts. In this half course, students will spend the first part of the year providing a foundation for the work through readings, discussions, and virtual (and actual, as logistics permit) field trips, and develop an introductory project designed by individual students and the instructor at midyear. In the spring, students will develop independent projects incorporating the structures and concepts studied in the first semester. "
  },
  {
    "name": "Chinese 1",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course is an introduction to Chinese, the official language of China. The course emphasizes spoken Chinese and written characters, paying particular attention to the tones and proficiency in handling everyday situations in the language. Reading and listening skills are also introduced so that students can begin to feel comfortable expressing themselves verbally and in writing. By the end of the first year, students will have learned more than 350 vocabulary terms. "
  },
  {
    "name": "Chinese 1P (Prior Study)",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course is designed for those who have previously studied or been exposed to Chinese but have not mastered the skills, the grammar, or characters required for Chinese 2. It is also appropriate for Chinese heritage speakers who don’t have the reading and writing skill required for Chinese 2. (Permission of the department chair is required.) "
  },
  {
    "name": "Chinese 2",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course builds on the foundation of Chinese 1 or Chinese 1P and is a continuation of the development of essential language skills. Greater emphasis will be placed upon communicating accurately and effectively in the four modalities: listening, speaking, reading, and writing. Students will learn more basic grammatical structures and can expect to have learned 750 vocabulary terms by the end of the year. Students hone their skills through a variety of activities: paired and small-group speaking practice, writing assignments, skits, video projects, and presentations. "
  },
  {
    "name": "Chinese 2 (Honors)",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course covers the same content as Chinese 2. The goal of Chinese 2 (Honors) is to continue to develop oral and written command and to inspire integrated and creative use of the language. Students are expected to complete longer reading and writing assignments outside the classroom and to master grammar skills and vocabulary through graded readers and creative writing. Students will expand their knowledge and deepen their cultural understanding and sensitivity. (Permission of the department chair is required.) "
  },
  {
    "name": "Chinese 3",
    "dept": "Chinese",
    "notes": "",
    "desc": "Chinese 3 prepares students to handle more complex situations in Chinese. The length of written work increases as students learn characters and gain confidence. The course also continues to stress listening comprehension and speaking about Chinese culture in the target language. By the end of the year, students can expect to have learned 1,020 vocabulary terms. "
  },
  {
    "name": "Chinese 3 (Honors)",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course covers the same content as Chinese 3, but with more frequent writing assignments and a greater variety of projects. Apart from the textbook, Chinese 3 (Honors) students are required to read two graded Chinese readers throughout the year to improve their proficiency in Chinese characters, which is considered most challenging for most learners. They also have to do written and oral reports on what they read and share them with the class. (Permission of the department chair is required.) "
  },
  {
    "name": "Chinese 4",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course builds on the foundation of Chinese 3 and continues to develop the requisite skills of this level in speaking, listening, reading, and writing. Students will have learned the most grammatical structures of the Chinese language and 1,500 vocabulary terms by the end of the year. It includes a systematic review of grammar and practice of the language through frequent writing assignments, speaking practice, and discussion of cultural events. It makes use of authentic materials such as poetry, picture books, and social media. "
  },
  {
    "name": "Chinese 4 (Honors)",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course covers the same content as Chinese 4. Students will continue to develop oral and written command and to inspire integrated and creative use of the language. Students are expected to complete longer reading and writing assignments outside the classroom and to master grammar skills and vocabulary through graded readers and creative writing. Students will expand their knowledge and deepen their cultural understanding and sensitivity. (Permission of the department chair is required.) "
  },
  {
    "name": "Chinese 5",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course is taught exclusively in Chinese and moves students from intermediate to advanced level. Through personal narratives, conversations, and journalistic reading and writing, students will be able to differentiate between the informal and formal speech in Chinese language. Meanwhile, they will also apply these principles in writing about their personal lives. (Open to students who have completed Chinese 4 or Chinese 4 (Honors).) "
  },
  {
    "name": "Chinese 5: Expressive Chinese",
    "dept": "Chinese",
    "notes": "(Semester 2) ",
    "desc": "This course allows students to join Chinese 5 for semester 2 only. Through personal narratives, conversations, and journalistic reading and writing, students learn to differentiate between the informal and formal speech in Chinese language as well as apply such principles in journaling about their personal experiences. (It is open to Class I students who have completed Chinese 5 and wish to take a semester course. Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Chinese: Chinese Literature I",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course builds on the foundation of Chinese 5 and is taught exclusively in Chinese as an introduction to the formal study of Chinese literature. Students will study and accumulate four-character phrases and apply them in their writing. They will read, analyze, and write poems, essays, and short stories. They will also experiment writing in the styles of the authors they read such as Zhimo Xu (徐志摩), Cheng Gu (顾 城), Lao She (老舍), Ji Mi (幾米), Ziqing Zhu (朱自清), Nianzhen Wu (吳念真), and San Mao (毛三), etc. (Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Chinese: Poems, Essays, and Short Stories in Chinese",
    "dept": "Chinese",
    "notes": "(Semester 2) ",
    "desc": "This course allows students to join the Advanced Chinese 6 for semester 2 only. Students will read, analyze, and write poems, essays, and short stories. It is open to Class I students who have completed Chinese 5 and wish to take a semester course. (Permission of the department chair is required.) "
  },
  {
    "name": "Advanced Chinese: Chinese Literature II",
    "dept": "Chinese",
    "notes": "",
    "desc": "This course builds on the foundation of Chinese 6 and is taught exclusively in Chinese. Students will read different ancient and contemporary literary genres, including ancient classics, modern prose, autobiographical fiction, and memoirs. Students seek to understand the individuality and interconnectedness of the different Chinese-speaking cultures while reflecting on their own development of personal identity. Titles, available in both traditional and simplified characters, may include Rong Jiang (姜戎)’s Wolf Totem (狼图腾), Alison Hui’s Explore Hong Kong Taste (香港尋味), Xueqin Cao (曹雪芹)’s Dream of the Red Chamber (红楼梦), and Ying-tai Lung (龍應 台)’s Dear Andreas (親愛的安德烈), etc. (Permission of the department chair is required.) "
  },
  {
    "name": "French 1",
    "dept": "French",
    "notes": "",
    "desc": "This course provides an introduction to French through essential grammatical structures, idiomatic expressions, and everyday vocabulary. Students use French in skits, dialogues, and oral and written presentations. Students learn to express themselves in real-life situations. They also learn about various French-speaking cultures through activities, songs, art, and short stories. "
  },
  {
    "name": "French 1P (Prior Study)",
    "dept": "French",
    "notes": "",
    "desc": "This course is intended for students who have previously studied French but who need to strengthen their foundational language skills before taking French 2. This course has the same objectives as French 1 but allows for a greater depth and variety of activities, given the students’ previous experience with the language and culture. "
  },
  {
    "name": "French 2",
    "dept": "French",
    "notes": "",
    "desc": "This course continues to develop oral and written command of all basic structures in French and introduces the reading of short books such as Le Petit Nicolas and Le Petit Prince. Many other cultural readings, projects, and audio-visual materials connect students to various aspects of daily life in France and in the French-speaking world. "
  },
  {
    "name": "French 2 (Honors)",
    "dept": "French",
    "notes": "",
    "desc": "The goal of French 2 Honors is to continue to develop oral and written command beyond basic structures in French and to inspire integrated and creative use of the language. Students continue to acquire grammar skills and vocabulary through readings such as Le Petit Prince and short stories by Le Clezio and Anna Gavalda. In this course, students will start with an introduction to reading to advance to literary analysis. Great emphasis will be placed upon communicating accurately and effectively in the four modalities: listening, speaking, reading, and writing. Students will expand their knowledge and deepen their cultural understanding and sensitivity. Placement is at the discretion of the department. "
  },
  {
    "name": "French 3",
    "dept": "French",
    "notes": "",
    "desc": "This course continues to develop the requisite skills of this level in speaking, listening, reading, and writing. It makes use of authentic sources such as film, art, songs, and media. Literature is introduced through readings by francophone authors. French 3 includes a systematic review of grammar and practice of the language through frequent writing assignments, speaking practice, and discussion of cultural and current events. "
  },
  {
    "name": "French 3 (Honors)",
    "dept": "French",
    "notes": "",
    "desc": "This course provides a rapid expansion of vocabulary and grammar through reading and writing. Students will be asked to write compositions of increasing complexity. Students continue to strengthen oral skills through activities ranging from review of current events to literary discussions. Reading skills are developed through an introduction to classical and modern authors such as Molière, La Fontaine, Maupassant, and Pagnol. (Placement is at the discretion of the department chair.) "
  },
  {
    "name": "French 4: Topics in Contemporary Culture & Literature",
    "dept": "French",
    "notes": "",
    "desc": "In French 4, students embark on a journey into contemporary French culture and literature while strengthening their language skills. Students will study grammar and vocabulary in context and practice using French through a variety of oral and written activities. French 4 gives students all the necessary linguistic tools to analyze works of literature, to articulate their opinion on current events, and to review films. Among the materials included in this course are the play Huis Clos by Jean-Paul Sartre, No et Moi by Delphine de Vigan, and several short stories from contemporary French authors. These works are the base of a much broader exploration of French culture through the use of different media. "
  },
  {
    "name": "French 4 (Honors)",
    "dept": "French",
    "notes": "",
    "desc": "French 4 (Honors), “French language, literature, and culture,” is the continuation of French 3 (Honors). This is an advanced class that allows French students to continue to develop fluency in the four language skills: listening comprehension, reading comprehension, writing, and speaking. French 4 (Honors) provides extensive grammar review and exposes students to the key events and concepts of French culture and history. Our study in French literature ranges from the classical literature of Sartre to the contemporary work of Delphine de Vigan. Students enrolled in this course will be expected to read extensively. In addition, students will regularly write analytical, critical, and comparative essays. Students must be able to express themselves at a written level appropriate to honors-level study. (Open to students who have completed French 3 (Honors) and French 3 with permission from the department chair.) "
  },
  {
    "name": "French 5 (Honors): A Further Exploration of Literature",
    "dept": "French",
    "notes": "",
    "desc": "This course is intended for students who have completed French 4 (Honors) and who have expressed an appreciation of French literature in previous courses. Covering classic writings—from the poetry of Baudelaire to contemporary works of French-speaking authors from Africa and the Caribbean—this course aims to refine the skills that are essential to enjoying and studying literature at an advanced level. This course prepares students for the study of French at the college level and, specifically, the college-level technique of close literary analysis. This course requires intensive reading and writing in French. (Placement is at the discretion of the department chair.) "
  },
  {
    "name": "French 5: The Francophone World",
    "dept": "French",
    "notes": "(Semester 1) ",
    "desc": "This multimedia and multidisciplinary course introduces students to the diversity of the French-speaking world. Through the study of films, documentaries, novels, visual art, poetry, and music, students will learn about French culture outside of France and will become familiar with the following concepts: colonial history and postcolonial identity, oral tradition, acculturation, bilingualism, race, and identity. Students will complete projects in multiple forms, but the focus is on oral communication in French. "
  },
  {
    "name": "French 5: Twentieth-Century France Through its Cinema",
    "dept": "French",
    "notes": "(Semester 2) ",
    "desc": "This course focuses on the issues of coming of age and living in French society as seen through the eyes of major French and Francophone directors ranging from Francois Truffaut to Cédric Klapish. The course also looks at cinema as a language of its own, starting with early silent movies by the Lumière brothers and culminating with the experimental technique of directors such as Claire Denis. Students taking this course will become familiar with the French attitude toward what is called the “Seventh Art.” They will also learn to write creatively about film the way the French “cinéphiles” do, using both technical and analytical perspectives. Students will complete projects in multiple forms, but the focus is on oral communication in French. "
  },
  {
    "name": "Spanish 1",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course provides an introduction to Spanish, including everyday vocabulary, idiomatic expressions, and essential structures of grammar. Special focus is placed on present and past tense conjugations, pronunciation, and the use of pronouns. Students develop competence and confidence in Spanish as they learn to express themselves, writing and speaking in real-life situations. They learn about the Spanish-speaking world through readings, presentations, and projects. "
  },
  {
    "name": "Spanish 1P (Prior Study)",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course focuses on developing a solid foundation in essential language skills. It is intended for students who have previously studied Spanish but have not mastered the skills or grammar required for Spanish 2, particularly the past tenses. Considering the student’s previous experience with the language, they will develop their Spanish proficiency through readings, compositions, projects, and presentations. "
  },
  {
    "name": "Spanish 2",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course is a continuation of the development of essential language skills. It completes the foundation of Spanish grammar, including the indicative, imperative, and present subjunctive. Students hone their skills through a variety of activities: paired and small-group speaking practice, skits, projects, and presentations. Through short stories and cultural readings, students explore various aspects of life in the Spanish-speaking world. "
  },
  {
    "name": "Spanish 2 (Honors)",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course covers the same content as Spanish 2, but with more extensive readings, more frequent writing assignments, and a greater variety of projects. Spanish 2 (Honors) develops critical reading and writing as well as creative writing skills that prepare students for work in upper-level courses. (Placement is at the discretion of the department.) "
  },
  {
    "name": "Spanish 2/3 (Accelerated)",
    "dept": "Spanish",
    "notes": "",
    "desc": "The goal of Spanish 2/3 is to inspire integrated and creative use of the language. The course takes a contextualized approach to language learning using authentic content and context as a way to improve and inspire language learning. Students master grammar and vocabulary through readings, discussions, and essays on selected topics. Spanish 2/3 also introduces students to the study of literature through short stories and poetry. The course meets five times per week. Placement is at the discretion of the department and enrollment is normally limited to 12 students. Students who take this course are expected to continue their study of Spanish at level 4. (Note: Class I students taking this course to complete their foreign language requirement must remain in class through the spring semester, including the senior project period.) "
  },
  {
    "name": "Spanish 3",
    "dept": "Spanish",
    "notes": "",
    "desc": "In this course, students review and study grammatical structures in depth, paying careful attention to the more complex aspects of the language through activities and practice. The course takes a contextualized approach to language learning. The units and readings are centered on current, compelling themes. Upon completing this course, students will be able to express themselves not only in everyday situations, but also in social and literary discussions. This course introduces the study of art and literature from Spain and Latin America. "
  },
  {
    "name": "Spanish 3 (Honors)",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course covers the same content as Spanish 3, but with a more extensive reading list, more frequent writing assignments, and a greater variety of projects. Spanish 3 (Honors) develops critical reading and writing as well as creative writing skills that prepare students for work in upper-level courses. (Placement is at the discretion of the department.) "
  },
  {
    "name": "Spanish 4: Cultural Legacies in the Americas",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course examines cultural legacies related to language, religion, identity, and power in the Americas. Students will consider mythology, religion, art, literature, music, film, and other primary sources as lenses to view these legacies and evaluate the ways they shape current issues related to identity and sociopolitical structures in our hemisphere. The specific topics and geographical scale of the study will be determined by the teacher(s) and students. Students will review fundamentals from Spanish 3 (or its equivalent) and build their skills as upper-level language students. "
  },
  {
    "name": "Spanish 4 (Honors)",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course is an introduction to the formal study of Hispanic literature. The focus of the course is the “Boom” in Latin American literature and the cultural, political, and social factors that contributed to it. Students will read, analyze, and discuss the works of authors such as Jorge Luis Borges, Gabriel García Márquez, Carlos Fuentes, and Julio Cortázar. Through the study of these authors, students will gain understanding of their impact on world literature and their influence on post-Boom authors such as Isabel Allende, Ángeles Mastretta, and Laura Esquivel. Students enrolled in this course will be expected to read extensively. In addition, students will regularly write analytical, critical, and comparative essays. Students must be able to express themselves at a written level appropriate to honors-level study. (Open to students who have completed Spanish 2/3, Spanish 3, Spanish 3 (Honors) with permission from the department chair.) "
  },
  {
    "name": "Spanish 5: Inside Latin America",
    "dept": "Spanish",
    "notes": "(Semester 1) ",
    "desc": "This course will guide students through some of Latin America’s most significant historical, political, and social changes. These topics will be explored through both literature and film. In this semester course, students will examine countries in Central and South America, considering their shared histories and their unique position in the modern world. (Open to students who have completed Spanish 4 or Spanish 4 (Honors).) "
  },
  {
    "name": "Spanish 5: Discovering El Caribe",
    "dept": "Spanish",
    "notes": "(Semester 2) ",
    "desc": "This course will provide students with a more comprehensive understanding of the culture, history, and unique geographic importance of El Caribe. Students will examine the Caribbean islands of Cuba, the Dominican Republic or Puerto Rico through literature, art, and film. Students will come to understand the individuality and interconnectedness of the islands of the Caribbean while studying concepts of ethnic, racial, cultural, and sexual identity. (Open to students who have completed Spanish 4, Spanish 4 (Honors), or Spanish 5 fall semester.) "
  },
  {
    "name": "Spanish 5 (Honors)",
    "dept": "Spanish",
    "notes": "",
    "desc": "This course expands on the works and themes of Spanish 4 (Honors). Through a close, contextualized reading of a variety of works by Spanish and Latin American writers, students will continue to build analytical skills and expand their global awareness. Students will explore all literary genres and respond to the works with critical, analytical, and comparative essays as well as creative projects. Students will explore works and ideas in a cultural, contextual framework appropriate for honors-level study. (Open to students who have completed Spanish 4 (Honors) and who receive permission from the department chair.) "
  },
  {
    "name": "Physics",
    "dept": "Science",
    "notes": "",
    "desc": "Physics is a full-year survey course in general physics that provides solid preparation for students to move on to other science courses. Topics covered include kinematics, dynamics, momentum, energy, waves, sound, electricity, and more. Students will use both qualitative and quantitative methods to develop understanding of these fundamental concepts, with an emphasis on problem solving techniques. Assigned laboratory activities reinforce and/or expand on the concepts discussed in class and stress the experimental procedures of science. Many of these labs use an inquiry-based approach. Students will complete their physics experience by creating, proposing, and conducting an individual design-your own experimental project "
  },
  {
    "name": "Chemistry",
    "dept": "Science",
    "notes": "",
    "desc": "Chemistry is a full-year course in general chemistry. Topics include an introduction of the study of matter, measurement, atomic theory, stoichiometry, gas laws, nomenclature, and equilibria. The curriculum is skills centered, emphasizing student mastery of problem-solving methods in the laboratory and the classroom. Moreover, the symbiosis of applying qualitative and quantitative analysis facilitates proficiency in the laboratory through the inquiry method. Students will find that formal lab investigations become progressively more inquiry driven. Laboratory work culminates in the design your-own independent lab project. "
  },
  {
    "name": "Chemistry (Honors)",
    "dept": "Science",
    "notes": "",
    "desc": "Chemistry (Honors) is a rigorous course in which students study the properties and behavior of matter and the laws governing chemical reactions. Among others, the course covers the following topics: quantum atomic theory, molecular structure, stoichiometry, gas laws, thermochemistry, electrochemistry, acids and bases, equilibrium systems, and reaction kinetics. The laboratory work emphasizes an inquiry process by requiring students to design independent investigations based on the formulation of open-ended questions, while also stressing the process involved in real world scientific research. Both the class work and the laboratory work of this course build on a lab-based physics course. (Prerequisite: a course in physics and permission of the department chair.) "
  },
  {
    "name": "Biology",
    "dept": "Science",
    "notes": "",
    "desc": "Classes I & II, or with permission of the department chair Biology is the study of life. Designed to follow a course in chemistry, this course will explore the evolutionary and ecological diversity of life through an inquiry-teaching model. We also strive to highlight and contextualize current issues, including climate change, nutrition and health, infectious disease, skin color, and race. Broad themes in Biology include evolution, ecology and energetics, genetics, heredity, and molecular biology. As the year progresses, we emphasize connections between broad biological concepts—ecology and human biology, evolution and energy, and the use of biotechnology, for example. Laboratory work builds through the year to become progressively more inquiry driven, culminating in a design-your-own independent lab project. "
  },
  {
    "name": "Biology (Honors)",
    "dept": "Science",
    "notes": "Classes I & II ",
    "desc": "Designed to follow a course in chemistry, this accelerated course will explore molecular, cellular, organismal, and ecological biology through an inquiry teaching model. Broad themes in Biology (Honors) include biochemistry, ecology and energetics, cell structure and function, molecular biology, genetics, and heredity. Students will explore the material through class discussions, review of scientific literature, and work in the laboratory; they will practice critical thinking and writing as well as designing, conducting, and analyzing experiments. There is a substantial out-of class lab component in Biology (Honors) that students will need to coordinate with their lab partner(s). (Prerequisites: a course in chemistry and permission of the department chair.) "
  },
  {
    "name": "Advanced Courses in Science",
    "dept": "Science",
    "notes": "",
    "desc": "Class I or with permission of the department chair The goal of these courses is to give our most capable, motivated science students an opportunity to further explore topics in each individual subject area. These courses include a significant amount of inquiry-based laboratory work. Through these explorations, students will broaden their understanding of the natural world. These courses may include readings of primary research, other scientific literature, and scientific textbooks, along with class discussions and inquiry-based lab work (both independent from and in concert with the instructor). To register for any of these courses, students must have completed laboratory courses in physics, chemistry, and biology and have permission from the department chair. Students may take Advanced Physics or Advanced Chemistry concurrently with Biology (Honors) with permission from the department chair. If a student chooses to move out of Biology (Honors) for any reason, they will be required to drop the advanced course being taken concurrently. All full-year science courses at Milton Academy qualify as laboratory courses. If students have taken courses at other institutions, they should contact the Registrar’s Office and the department chair, who will determine whether they can receive credit for that work. All students in Advanced Courses in Science will be required to present at our end-of-year Science Symposium. 8 Milton Academy "
  },
  {
    "name": "Advanced Biology",
    "dept": "Science",
    "notes": "",
    "desc": "This course allows students to deepen their understanding of biological concepts and hone their laboratory technique, skills, and writing. Much of the work in class will integrate molecular biology techniques to elucidate principles studied. In the first semester, students will study cell signaling and prokaryotic gene expression. In the second semester, students will study evolutionary biology. Studying evolution will allow students to integrate all areas of biology with understanding the process and outcome of evolution. Possible explorations include analysis and synthesis of synthetic DNA devices, assay of gene function in bacteria, analysis of mc1r sequence and mitochondrial DNA in the student’s genome, tissue regeneration in flatworms, sexual development of c-ferns, evolution of biofilms in bacteria,; genome sequencing, and behavior of c. elegans. Students will practice laboratory techniques necessary in the study of the organisms, and they will further their understanding of the concepts and protocols of molecular biology. Students should enjoy working in the lab and want to push themselves in studying biological sciences. We will use primary scientific articles as models of research and as a means of learning the material. "
  },
  {
    "name": "Advanced Chemistry",
    "dept": "Science",
    "notes": "",
    "desc": "The goal of this course is to provide students with the knowledge and skills to investigate chemistry as it relates to their own scientific interests. Students will be introduced to advanced laboratory equipment and will more deeply study technology used in previous classes. Mini design-your-own labs are incorporated into the class every six to eight weeks to enable students to design and execute projects that apply the skills we have mastered to areas of personal interest in science. Topics of study include kinetics, equilibrium, acids and bases, and electrochemistry. Assessment in this class comprises problem sets and laboratory work. It includes a wide range of reporting formats as well as creative projects. A successful student must be able to work well independently and in close partnerships; demonstrate a strong commitment to safe lab work; and be willing to take intellectual risks in pursuit of creative research. "
  },
  {
    "name": "Advanced Environmental Science",
    "dept": "Science",
    "notes": "",
    "desc": "The study of Environmental Science is driven by the relationship between humans and the natural environment. In this class, students will explore this relationship using an interdisciplinary approach that builds on students’ science backgrounds with new material from Earth system science. Our focus is on understanding how nature works, and on finding solutions to real environmental problems through the “doing” of real science. Coursework is heavily weighted toward fieldwork, and as such, students should be excited about frequent outdoor field activities. Our proximity to the Blue Hills, the Neponset River Estuary (the only remaining salt marsh estuary in Boston Harbor), and numerous local wetlands and streams provides an unusually rich natural laboratory learning resource. In recent years, this course has focused on a long-term ecological monitoring study of a local ecosystem in collaboration with the Neponset River Watershed Association, a local watershed authority. "
  },
  {
    "name": "Advanced Physics",
    "dept": "Science",
    "notes": "",
    "desc": "In Advanced Physics, students study Newtonian Mechanics in the fall and waves in the winter. With weekly problem sets, students develop a fluency in problem solving skills. Students are challenged with practical application of the laws they have learned by predicting where a projectile will land, how springs interact, or where a ball will go after it collides with another, etc. In the winter, students investigate the wave nature of light and sound culminating with the construction of their own musical instrument. In the spring, students conduct a self-designed experiment and present their findings to students in other advanced classes. "
  },
  {
    "name": "Neuroscience",
    "dept": "Science",
    "notes": "",
    "desc": "We will begin this course by venturing into the scientific study of the brain with a focus on the anatomical structures of the brain and their functions. We will follow with in-depth exploration of neuronal communication. Topics will be applied through investigation of stress and relaxation, addiction, mental health disorders, and neurodegenerative diseases. A few relevant dissections and labs will be performed. As this is an ever changing field, students will learn to read and investigate scientific literature to understand the most recent theories and latest pharmacological interventions for what we study. (Prerequisite: a course in biology.) "
  },
  {
    "name": "Disease Biophysics: Understanding the Science of Maladaptation",
    "dept": "Science",
    "notes": "",
    "desc": "Innovative solutions to the world's foremost problems frequently lie at the interface of science disciplines. Perhaps unsurprisingly, to understand the mechanisms that drive leading causes of disease, one must integrate foundational concepts of biology, chemistry, and physics. Mechanical forces drive cellular organization and architecture, communication and subsequent functional output; structure and function. But how can our understanding of conceptual physics, chemistry, and biology elucidate the processes that drive maladaptive states such as cardiac arrhythmia and atherosclerosis, cancer, and traumatic brain injury? Further, how can we model and test our understanding in the laboratory? In Disease Biophysics, we will explore these questions together as we deconstruct real patient case studies in order to dissect disease pathologies. Students can expect to cultivate a dynamic skill set as they visualize and synthesize disease models to understand systemic implications of cellular maladaptation. Proactive collaboration, creative problem-solving and robust literature review will prove central to students’ learning process. An evolving student portfolio will provide the primary mode of assessment and will serve to demonstrate both depth of understanding and competency in transferring knowledge to disease contexts by way of student-generated modeling and lab-based experimentation. (Prerequisites: a full year of biology, chemistry, and physics, or permission of the department chair, are required.) "
  },
  {
    "name": "Human Anatomy and Physiology",
    "dept": "Science",
    "notes": "",
    "desc": "(Semester 1 or Semester 2) Human Anatomy and Physiology challenges students with a variety of approaches geared toward developing a strong fundamental understanding of the structure and functioning of the human body. Classroom discussions emphasize physiological concepts, with special attention to the anatomical features of the system being studied. The course begins with an overview of cellular anatomy and physiology. The systems addressed over the course of the semester typically include the skeletomuscular system, cardiovascular system, lymphatic system, respiratory system, endocrine system, and excretory system. Other body systems are touched upon in the context of discussions of the previously mentioned systems. Evaluation for the class is based on participation in class discussions and in group work, in-class and take-home assessments, dissections, and one or two in-class presentations. "
  },
  {
    "name": "Marine Science",
    "dept": "Science",
    "notes": "",
    "desc": "(Semester 1 or Semester 2) This course investigates the biology, ecology, and adaptations of marine life as well as the most recent and intriguing research in this content area. The course emphasizes independent and small-group lab work, research into current topics, and presentations of these investigations. Major topics studied will be biological oceanography, the fundamental concepts of biology that relate to the marine environment, a survey of marine life, and important, timely issues in marine science. Lab work is a key component of this course, as students will work in the lab every week exploring the concepts of the course. Additional assignments require students to take advantage of the resources available in the area, such as the New England Aquarium, and visits to local marine and estuarine habitats. Lab work includes comparative anatomy done through dissection and direct observation of live marine animals. "
  },
  {
    "name": "Issues in Environmental Science: Solutions for a Sustainable Future",
    "dept": "Science",
    "notes": "",
    "desc": "(Semester 1 or Semester 2) The world faces a number of urgent environmental issues such as human population growth, air and water pollution, and climate change. While many of these topics seem overwhelming, all can be addressed with existing or emerging technologies ranging from the obvious (e.g., renewable energy, urban farming, and electric vehicles) to the futuristic (e.g., lab-grown meat, floating cities, and geoengineering). This course will begin with environmental science fundamentals and move to the development of practical solutions based on that science. By investigating changes that we can make on a personal or local level, students will gain insight into how to affect change on the national and global stage. This project-based curriculum uses current scientific literature and interaction with professionals in the environmental field as well as podcasts, TED talks, and other media to give students a variety of perspectives. "
  },
  {
    "name": "Observational Astronomy",
    "dept": "Science",
    "notes": "(Semester 1) ",
    "desc": "In this course, we study all things astronomical, from the life and death of stars to the evolution of the universe, from the solar system to the history of astronomy. Students conduct semester-long projects of their own choosing in consultation with the instructor. In the past, students have observed variable stars, sunspots, the moons of Jupiter, and the setting position of the sun. In the weekly observing sessions, students locate objects discussed in lectures using the Robert C. Ayer double-domed observatory that is equipped with permanently mounted 9- and 12-inch reflecting telescopes as well as several portable telescopes. Students also take pictures of celestial objects using the special cameras provided. "
  },
  {
    "name": "History and Philosophy of Science",
    "dept": "Science",
    "notes": "(Semester 1) ",
    "desc": "We have all heard the claim that we are living in the ‘post-truth age’ and are all familiar with the phrase \"alternative facts.\" Climate change denialism and vaccine scepticism pose serious risks to current and future generations. And scientists in particular are experiencing the erosion of their social trust and expert authority, with some being literally threatened by conspiracy theorists. This History and Philosophy of Science class gives students an opportunity to consider what sets the scientific method apart as a reliable way to produce knowledge, and what might be behind the current crisis of legitimation. We will survey the history of how philosophers and scientists have attempted to answer the ‘question of demarcation’, meaning what distinguishes science from pseudoscience as well as from other non-scientific theories and practices; we will also consider the history of bioethics, (dis)trust in science, and attempts to make science more inclusive, socially responsible, and politically accountable. Students will be expected to complete readings of, and written responses to, primary and secondary sources, and engage in vibrant class discussion. Guest speakers, including local intellectuals and activists, and field trips, such as to the Harvard Museum of Natural History, will be a part of the course as well. "
  },
  {
    "name": "Cosmology and Modern Physics",
    "dept": "Science",
    "notes": "(Semester 2) ",
    "desc": "Discoveries made during the last 60 years in physics have radically changed our view of the universe. Astronomers and physicists use their understanding of the very small structures of matter, such as quarks, to explain the very large structures, such as the distribution of galaxies in the universe. In this course, students learn about the wave particle duality of matter, the quark model of matter, elementary particle discovery and classification, the grand unification of forces, the Big Bang theory, black holes, and the end of the universe. (Prerequisites: a course in both physics and chemistry.) "
  },
  {
    "name": "Molecular Genetics 1",
    "dept": "Science",
    "notes": "(Semester 1) ",
    "desc": "This course educates students about the science and technology of the field of molecular genetics. Students briefly review the basic structure and function of DNA. For the first half of the semester students will isolate, amplify, and sequence their TASR38 gene. Students will determine their haplotype and correlate it with their ability to taste a bitter tasting chemical. Students then complete a set of cloning and sequencing protocols of a plant housekeeping gene. After completion of these protocols, students will have the fundamental skills necessary to clone and sequence a gene in the laboratory. Skills developed in the course include nucleic acid extraction, performance and analysis of nested polymerase chain reaction (PCR), electrophoresis, size-exclusion chromatography, DNA ligation and bacterial transformation, microbial culturing, and sequencing and bioinformatics. The majority of the work in this class is laboratory-based. (Prerequisite: a course in biology.) "
  },
  {
    "name": "Molecular Genetics 2",
    "dept": "Science",
    "notes": "(Semester 2) ",
    "desc": "Molecular Genetics 2 is a laboratory course where students apply the skills, techniques, and knowledge learned in Molecular Genetics 1 to explore topics, including Drosophila genetics, gene regulation by RNAi in c. elegans, and molecular cloning of GAPDH genes and bioinformatics. Topics change periodically depending on student interest and skills. Several topics provide opportunities to engage with professional researchers in the Boston area. Students should be interested in planning and conducting long-term projects in the lab. Students are required to present their work at the Science Symposium at the conclusion of the second semester. (Prerequisites: a course in biology and Molecular Genetics 1.) "
  },
  {
    "name": "Organic Chemistry 1",
    "dept": "Science",
    "notes": "(Semester 1) ",
    "desc": "Enter the world of medicines and plastics, of skunk spray and gasoline, of steroids and sugars. Enter the world of organic chemistry—the chemistry of carbon! This challenging course will focus on the fundamentals of organic chemistry and will include an introduction to molecular structure, stereochemistry, and the mechanisms of synthesis reactions. These fundamental ideas will be exemplified in discussions revolving around relevant synthetic molecules as well as important, naturally occurring biological entities. To deepen their understanding of the course material, students will be expected to participate in, and ultimately drive, laboratory experiments exploiting an inquiry-based learning approach. In total, knowledge gained from this class will equip the students with the critical rudiments in organic chemistry, a common collegiate requirement for science and engineering, pre-medicine, pre-dentistry, and pre pharmacy majors.(Prerequisites: A course in chemistry and biology; biology may be taken concurrently.) "
  },
  {
    "name": "Organic Chemistry 2",
    "dept": "Science",
    "notes": "(Semester 2) ",
    "desc": "This course is designed to directly follow and build upon the content from Organic Chemistry 1. Specifically, students will garner a thorough understanding of both substitution and elimination reactions and their respective mechanisms. This knowledge will then be utilized in both laboratory and thought exercises aimed at predicting product formation from a given set of reactants as well as deliberate molecular design. The semester in Organic Chemistry 2 concludes with a major project in which students will profile a complex, biologically relevant organic molecule of their choosing. (Prerequisites: a course in chemistry and biology; biology may be taken concurrently, and Organic Chemistry 1.) "
  },
  {
    "name": "Directed Research 1: Medicinal Chemistry",
    "dept": "Science",
    "notes": "(Semester 1) ",
    "desc": "Medicinal Applications at the Interface between Synthetic and Computational Chemistry In this course, students will be conducting directed, original research studies. They will contribute to an ongoing multidisciplinary project that spans synthetic and computational chemistry as well as bioinformatics. Students will apply concepts learned in previous and concurrent core and advanced courses (chemistry, biology, and computer science), and make connections between different fields in real-life applications. The current ongoing projects include: 1) developing molecular linkers to attach imaging markers to medicinal antibodies, and 2) in silico investigation of biologically active compounds such as natural medicines. Students will also have the opportunity to collaborate with researchers from other institutes on parts that require sophisticated instrumental analyses. Technical skills gained through this course include: 1) synthesis and purification of organic molecules, 2) physical characterization of compounds using common techniques (e.g., NMR, FTIR, MS, pH meter, UV-Vis), and 3) computational simulations on small molecules and biomacromolecules using molecular docking and dynamics. Students will collaborate on a manuscript and attempt to publish any promising results in scientific journals. Assessment in this course depends on comprehension and presentation of the literature, and the quality of progress reports, both written and oral. (Prerequisite: A course in chemistry and biology; biology may be taken concurrently, and permission of the department chair) "
  },
  {
    "name": "Directed Research 2: Medicinal Chemistry",
    "dept": "Science",
    "notes": "(Semester 2) ",
    "desc": "This course is a continuation of Directed Research 1: Medicinal Applications at the Interface between Synthetic and Computational Chemistry. Students will use the research skills they acquired in the semester one course to individualize and advance their research projects. We will go on a field trip to a university instrumentation center to characterize our synthesized samples and learn from experts about instrumental analysis of organic molecules. We will also go on multiple field trips to a university immunobiology laboratory to learn about bioanalytical assays, and preclinical testing of drugs. While the majority of the work in this course is experimental, students will delve deeper into the literature and begin critiquing primary research articles. This will be followed by learning how to use published research articles to come up with new ideas for their projects. We will aim to present any publication or promising results at science conferences. Assessment in this course depends on comprehension and presentation of the literature, and the quality of progress reports, both written and oral. (Prerequisite: A course in chemistry and biology; biology may be taken concurrently, and Directed Research 1) "
  },
  {
    "name": "Engineering the Future",
    "dept": "Science",
    "notes": "(Half Course) ",
    "desc": "The Engineering the Future course welcomes intrepid thinkers to engage in imagining new and exciting ways to design a world that better serves all of its inhabitants. Students will spend several weeks studying civil engineering by constructing bridges and trusses out of coffee stirrers with each design restraint more stringent than the last. In electrical engineering, students will learn about Ohm's Law and Krichoff's Laws. They will then learn how to wire up integrated circuits. Later, students will study mechanical engineering by learning how to design and build products using computer aided drawing and the 3D printer. Finally, students will delve into the realm of chemical engineering, using the design skills they've developed to assess energy or fluid transfer in a system. In addition to a basic understanding of engineering design principles, this course aims to develop important life skills. These skills include the ability to assess a task, to design a product, to collaborate with others, to problem solve, to be open to others’ ideas, to think critically about our own ideas, and to present one’s observations and conclusions clearly. "
  },
  {
    "name": "Geology",
    "dept": "Science",
    "notes": "(Half Course) ",
    "desc": "Have you ever wondered about how rocks form, and what stories can they tell us about the Earth’s history? Why are there mountains, canyons, and coastlines, and how have these features formed over time? What are volcanoes and earthquakes, and how do we know if we’re living in an area that might be prone to natural disaster? This course is designed to introduce students to the world of geology, including the Earth’s origin, composition and structure; minerals and rocks; and the major Earth processes that have shaped and continue to shape the surface of our planet. Plate tectonic theory is a theme central to the course: mountains and rivers, geologic hazards, weather and climate, and even the evolution of life on Earth is intimately linked to this theory. Another overarching theme will be exploring the relationship between humans and geology, defined by our place in geologic time: the Anthropocene. The study of geology is, at its core, a field science. The proximity of Milton to the Blue Hills, in addition to other local resources, provides unique field opportunities to learn about major rock types, plate tectonics, weathering and erosion, and glacial processes as well as the human impact. As such, students should be eager to participate in regular outdoor fieldwork that promotes the learning and practice of geology. "
  },
  {
    "name": "Science in the Modern Age",
    "dept": "Science",
    "notes": "(Half Course) ",
    "desc": "The need for students to be scientifically literate and able to detect bias in the media is critical. Students must not only be informed of current science topics, but they must also be able to critically examine issues at hand and consider multiple perspectives. Through a seminar-style format, Class I and II students will be encouraged to examine their basic assumptions about science and will investigate the interplay between science and society. Students may interact with the greater scientific community in a variety of ways, including interviews, guest speakers, and a field trip. Using multimodal assessment, students’ learning will be measured by discussions, reading responses, debates, persuasive and journalistic writing, journaling, presentations, and projects. With citizens and future voters in mind, this course promotes scientific literacy, critical analysis, and good decision-making. Topics could include, but will not be limited to, bioethics, public health, epidemiology, DNA technology, genes and health, forensic science, sustainability, pharmacology, biodiversity, reproductive technology, and medical dilemmas. Students will utilize current science publications, podcasts, and videos as their primary resources. "
  }
]
